[
  {
    "selftext": "Hi, I searched through old posts but have so far only found posts relating to specific parts of the body - back pain, wrists, etc. Im very new to yoga - have tried to follow YouTube videos every so often for a couple of years but every time I give up after a week or so because of the pain.  I’m 21 years old and not terribly unfit but have dreadful posture and am the least flexible person I know. When I do child’s pose it hurts my inner thighs. When I try downwards dog I can’t get my feet down from my tip toes and although I’ve seen people say to bend your legs and keep your back straight I physically can’t - just trying hurts my lower back and shoulders. My wrists hurt when I put any pressure on them.  Etc. Almost every part of my body hurts too much to continue whenever I try. I’m not aware of any injuries or health issues - I’m just that inflexible. \n\nI had hoped yoga would make me more flexible, but the pain caused by being inflexible makes it extremely difficult and unpleasant to try for long enough to see any results. I’m at a loss. Any ideas?"
  },
  {
    "selftext": "Is it fine to do it for a skinny guy? I am thin, will i be losing weight if did surya namaskar? I want to gain weight."
  },
  {
    "selftext": "This morning, my wife asked me what half moon pose is which I explained and showed her. Then she thought for a second and said “well, what’s full moon pose?” Obviously, I dropped my drawers and mooned her, but it got me thinking. Is full chandrasana a pose?"
  },
  {
    "selftext": "I am not looking for medical advice, only yoga. \n\nMy left side is weaker than my right, with significant lack of motor skills and nerve dysfunction. This is diagnosed by doctors and I don't need Internet diagnoses. My PT says they may be just something I live with. \n\nI have been working on balance poses, especially one leg chair pose. I can do it just fine on my right leg but not at all on my left. \n\nIs there anything I can do?"
  },
  {
    "selftext": "This morning, our yoga teacher dedicated the practice to the victims of the the recent shootings in the US (California, Texas and Ohio). And what an incredible class it was. First, she never put the blame on anyone. She invited us to recognize that, as long as such things happen in the world, it means there's still some seed of hatred in all of us. And that, as hard as it may be, we need to look for it in ourselves and fight it. The practice consisted of a lot of expansive poses and, as the room was packed, she invited us to step on each other's matts when the pose required. Then she came up with a sequence that required an entire row of people to support each other. What a talented teacher, what a job well done. So thank you!"
  },
  {
    "selftext": "I’ve been doing yoga for some time now and I was wanted some tips on how to get stronger for more difficult poses. I’m currently working on my handstands, pass throughs and floats. Do you all find lifting weights in addition to yoga to be helpful or is it a matter of time thing or are there certain poses I can work through to get stronger? Any help would be appreciated thank you!!!"
  },
  {
    "selftext": "I don't do yoga, but It seems like deep breathing is very important. But I can't seem to do it unless I'm laying flat. Like if I'm sitting or standing I cannot do it. Is that normal? Or should I be able to do deep belly breaths from any position?\n\n&amp;#x200B;\n\nEDIT'; I actually have trouble doing it laying down as well. Like I get it out half way then it is too tight and it goes back to expanding the chest."
  },
  {
    "selftext": "Hi,\n\nI want to be able to get into either of these 4 postures for meditation: Siddhasana, Padmasana, Bhadrasana, or Swatikasana\n\nBut right now I am so inflexible, stiff, and rigid. All I can do is the normal easy cross leg pose (and I don't even find that comfortable, so usually just use a meditation bench for seiza)\n\nIs there any youtube vids or anything that shows what stretches and movements I should do to work on the areas needed for these poses?\n\nI'm not actually looking to start a standard yoga routine, I just want to achieve one of those asanas for meditation.\n\nthe scary thing is i'm only 25 and I feel like I have the flexibility of a senior. I feel like its gonna be such a long task just to achieve a basic asana :'("
  },
  {
    "selftext": "Hi, are there any books that explore the relationship between muscle groups and feelings or other non-physical  aspects? For instance How the psoas influence mood or (something that I’ve heard yogi mention often) how hips is where feelings are stored, etc.. \nanyone? Many thanks!"
  },
  {
    "selftext": "Subject line says it all. I'm curious how many people rely solely on yoga for their exercise, or whether you integrate another type, and if so, what have you found to be complementary?\n\nETA: Synopsis of answers, for science! :D Weights is by far the most-mentioned alternative exercise (10 mentions), followed by running (7), then cycling (5). Other responses were circuit training (2), rock climbing (1), HIIT (2), QiGong/Tai Chi (2), Hiking (3), Horse-Riding (1), Dog Walking or Self-Walking (2), Martial Arts (4), Swimming (1), Longboard (1), Pole (1), Rowing (1), Zumba (1), Boot Camp (1).\n\nThis was all really helpful. I want to focus on my yoga practice, but I'm also aware that I need more cardio than that. Being overweight, I think yoga with my own body weight for now will cover me pretty well on strength training, but I might work in some more hiking or dancing into my regimen, as both make me happy."
  },
  {
    "selftext": "As the title says, I'd like to get back into yoga and would like to start a home practice again.\n\nI practiced at home with Yoga with Adrienne series and once a week in a class for 1 year 1/2 before I let it go entirely last January. I have been fairly inactive ever since as well. \nThe pounds have piled on, am very rusty and very coach-potatoe like now :/\n\nI have checked the post in the FAQ about getting back into hiatus but it's been deleted and the comment didn't really helped.\n\nSo, I'm looking for recommendations for at home practice, in a series format (very much like what Adrienne does), hatha oriented and for beginners as I feel yoga with Adrienne has become too advanced for me now.\nAny suggestion? I've checked YouTube but nothing really stood out or appealed to me.\n\nThanks a lot everyone :)\n\nEdit: i did it!\n\nToday was day 1 of my journey back to Yoga.\nI downloaded the Downdog Intro to Yoga app and did the 20 mn Hatha sequence. It turned out to be rather challenging on my quads :/ but I feel so refreshed now!\n\nI have also installed the full app and suscribed and will start to slowly build up a practice with their beginners’ classes.\n\nThanks to everyone for their suggestions and advice :)"
  },
  {
    "selftext": "This is a serious SOS. I used to do yoga every day and it really helped me with chronic stress and back pain, then I started wrist pain and I realized i had incorrect wrist form.\n\nNow it’s been over a month of spending time on the mat in a simple tabletop position doing wrist stretches that i’ve found, then trying to bare weight on my wrists, and this lasts only about 45 seconds in proper form and I have to stop because my forearms burn so bad. I stretch a little bit then i try again and again to build up the strength.\n\nMaybe I just need to be patient but i was hoping there would be strength building exercises off the mat that can help me hold the pose for longer because this has been very discouraging.\n\nAlso I have read many articles on the topic and many youtube videos, but all of these are “on the mat” stretches and exercises. The only thing that makes my forearms actually burn is when i’m trying to hold correct wrist form...but again after a month i can still only hold it for like 45 seconds in tabletop. Can’t even do plank or downward dog :(  \n\nanyone been through this before? Any tips to build up strength because i don’t think my current routine is working."
  },
  {
    "selftext": " Please share your experiences/tips"
  },
  {
    "selftext": "I have been using the sweat app for a few years now and recently decided to try out the BAM yoga program. I’ve really liked it because it’s guided, both vocal and visual, and decently challenging. I’ve been looking around for reviews of this program or if there’s similar apps out there that may be even better? Interested to hear anyone’s experience or opinion. Thanks! :)"
  },
  {
    "selftext": "I just wanted to share a bit of an epiphany I had this week while in my second of many future yoga classes. \n\nI finally joined a yoga studio in a move to look after myself and my mental health. I had been following a yoga instructor for a while on Instagram who worked there and was encouraged when my work took me there one day. The Universe was clearly trying to tell me something. \n\nSo I was there, yoga-ing with some incredibly physically beautiful people and normal type people. As I looked closer, respectfully, I realized I could see all the flaws, “wobbly bits”, some incredible tattoo inking, and folds of skin. I saw my reflection and was disgusted with the “chunky monkey” looking back at me. \n\nBut here’s the kicker....\n\nI realized that I’m a beautiful person too!! Sure I’m a little overweight, stressed out at times dealing with my Nex-SO, but by being true to myself  it makes me a beautiful person who has a right to be with positive people. \n\nSo to all of you who are going through these tough times, stay beautiful!!\n\n\n...and do yoga!"
  },
  {
    "selftext": ".. I was doing so well, I suffer with depression and anxiety..\nAnd I started yoga last month to better my mental state and work on flexibility..\nI did great for 4 weeks.\n\nNow I've hit a slump.. I'm not motivated for it.. And by the time I have spare time I'm knackered and cba..\n\nThe flexibility practice is fine but I don't find the yoga helps me at all.. I tried to maintain a \"positive\" attitude which was nice.. But I just can't seem to feel the \"flow\" is this normal?"
  },
  {
    "selftext": "Basically the title.  I started using DownDog app for a guided yoga session every day, and it has been about a month since I started. I have done some yoga classes in the past so I am familiar with the correct form of some of the more beginner poses. \n\nI have been working on crow pose and it is definitely a challenge for me. I have noticed that I am getting some bruises on the back of my triceps from this, which makes me think I am doing it wrong. Any tips to avoid getting these bruises?"
  },
  {
    "selftext": "Hi friends - I've recently started taking yoga classes, and really enjoy them. With that being said, I actually have no clue what I'm doing. So, I'd like to start learning more about the form/technique/moves from knowledgeable yogis. Who are your favorite podcasters, youtubers, intagrammers, bloggers that provide insights on yoga practice? Also open to educational books/apps, but generally like hearing someone talk through a move. Let me know - thanks!"
  },
  {
    "selftext": "I just feel like expenses are a barrier to entry for a lot of people and I think a lot of people don't believe free options work as an alternative. \n\nThis is a genuine curiosity question and I just want to hear what people get out of their different forms of consuming yoga instruction.\n\nI realize with in-person classes you can find a community and I think that's an awesome benefit, but when classes are large I feel like the the most and least advanced people in the classes often get left behind.  Then there's the whole paying for online classes... I realize some are likely better than the hundreds of free ones but how can you know before you decide to spend?"
  },
  {
    "selftext": "have you ever gotten high from yoga? Not just a general wellness and well-being but literally the type of high you get from drugs?\n\nHaving never taken any recreational drugs I cannot compare, but there were days when I felt extremely good (and also creative) after doing yoga, but I can't be sure if it's a drug-like high. I've heard yoga is a lot like weed.\n\nHave you ever felt high yoga?"
  },
  {
    "selftext": "I think Yoga With Adriene is very good but she's too nice. I grew up playing sports and would feel more at home and relaxed if there was a yoga instructor that barked out orders and is high energy. Weird request I know but it would really help me out."
  },
  {
    "selftext": "Hello,\n\nI'm starting to get back into yoga after a while, and realized I need new yoga supplies (mat, blocks, etc.) \n\nI'm trying to make an effort to only purchase higher quality, ethical sourced and/or eco friendly brands (total tree hugger, I know) \n\nI've only found a handful of brands.  Honestly, while they are very well sourced, I don't know how the actual quality is, and I find many of the designs pretty bland.  I'm okay with getting a bland mat/blocks as long as it's good quality from a good brand, but I also wanted to see if anyone had any good recommendations before I jump in and spend a lot of money on a mat before I explore all of my options"
  },
  {
    "selftext": "I’ve had a home practice since the beginning of this year. I didn’t really have any high expectations but I’ve been good at doing it on a semi-regular basis (like, twice a week on average). Now I’m at a wall, I’m finding it hard to feel motivated, I don’t feel like I’m progressing at all and I’m not sure what to do. I can see how easy it would be to give up but deep down I don’t want to do that.\n\nAny ideas on how I can reinvigorate my practice?"
  },
  {
    "selftext": "Greetings gurus! I do strength training/bodybuilding three days a week, and on my off days I'd like to do some yoga to become more flexible, and to avoid becoming really stiff as a result of my lifting. What style do you recommend? Since these are my muscle recovery days, I'd prefer not to do anything that requires a lot of strength, like vinyasa, but maybe something that focuses more on stretching and mobility? Thanks in advance!"
  },
  {
    "selftext": "Hey all, I'm a guy who recently got into yoga, but a few positions are ambiguous with regards to where your package is supposed to go. \n\nDoes anyone have any experience/thoughts/advice?\n\nI do yoga in the nude when I can and with looser fitting shorts/pants when I can't be nude for whatever reason. \n\nAny input would be appreciated. Thanks!"
  },
  {
    "selftext": "Fellow sweaty yogis, what headbands do you use during hot yoga to keep the sweat out of your eyes? I've recently started going to a heated power vinyasa class, and the headbands that I use for other workouts just aren't cutting it. I have sweat streaming into my eyes after about 20 minutes, and it's distracting as well as painful. So what do y'all recommend?"
  },
  {
    "selftext": "Hi all, I've searched high and low and cannot find anything online... I just started some yoga stretches and while doing cat/cow I feel a sharp pain in my lower abdomen while in cow pose. The pain goes up and down the middle of my lower/middle abdomen. I've never felt a pain like this and am hoping someone has some input?\n\nThanks!!"
  },
  {
    "selftext": "Hey! I wonder....\nHas any of you gained height by doing yoga? By how much have you increased your height? And for how long have you been performing yoga? PS . i know the gain would be from postural changes"
  },
  {
    "selftext": "Hi guys, there have previously been posts about [Five Parks Yoga](https://www.youtube.com/channel/UCrtTMWDx4u1dVKMpXNhjwpA), but I want to refresh it for those who are new. I love her style and I've watched all her videos multiple times. My first yoga practices were with Adriene, but I as started to learn, I needed more. I found Erin's channel and it was harder at the beginning, but I fell in love with her classes. She is focused on vinyasa yoga. The classes can be oriented around certain body parts (there is also a lot of strength building, never thought I would get nice sculpted arms, my male friends are impressed), or there are peak pose build up sessions. Furthermore they are often filmed in beautiful outdoor locations, in Costa Rica or Nicaragua.\n\nI am trying to support her as much as I can (already a patreon) and I hope she gets more subscribers."
  },
  {
    "selftext": "Bonus points for any routine that lasts at least an hour."
  },
  {
    "selftext": "I've recently been to a yin yoga class and absolutely loved it, especially the stillness and calmness that came with it. However I wasn't sure whether I'd been doing it quite right. \n When holding positions in class I didn't really feel a stretch. My teacher said we should be relaxing into the moves and being aware of our limbs without discomfort. But I didn't feel a stretch unless I tensed/held an active position rather than letting gravity help me out.\nIs this just how yin yoga is supposed to feel or am I missing something in my practice? \nI've also read that yin is supposed to be more about the connective tissues in between muscles, so would this be why it doesn't feel like a big stretch?"
  },
  {
    "selftext": "Today in my yoga class I got corrected, so just wanted to share / but also unsure whether it's the right way to do my Vinyasa flow! I initially learnt my Vinyasa flows by imitating others; my standard simple one flows from Downward facing Dog --&gt; High Plank --&gt; Chaturanga --&gt; Updog --&gt; Downward facing dog\n\nSo a few guidances were made today (thank you my Yoga Instructor!) to me to correct my poses: \n\n1. High Plank pose to ALWAYS engage Cow Spine, which I always forget\n2. Chaturanga to not \\*humfs\\* dump down (what I did was just dropping down to a level almost to the mat (about an inch off - more like dumping myself down to this \"default hovering pose\" that is much lower than a 90 degree angle in my arms) - now I know I need to maintain the 90 degree angle)\n3. From here : I used to **SLIDE/GLIDE** (somewhat like a snake down to the ground and upwards) to Updog -- but was corrected to just **straighten** my arms! Naturally it forms a Cobra/Updog.\n\nAnyway long story short, I was wondering what is the \"correct\" method we should do with? Is there any benefits at all doing a slide/glide in comparison to just straightening? I suppose by just straightening it might prevent any movements between the hands and feet so we continuously stay at a good position throughout. \n\nAny thoughts?"
  },
  {
    "selftext": "Hi, first time poster here, so I'm sorry if this has been asked before.\n\nI just started doing yoga last week and I'm absolutely loving it. I found a very welcoming studio offering a pretty wide variety of styles (I didn't even realize there were so many!). The only problem I'm having is that I'm constantly having to look around to check if I'm getting the postures right, and I feel like I'm maybe not getting as much out of class as I could otherwise. The instructors do their best to provide adjustments of course, but I'm not the only person there, or even the only beginner, so obviously I sometimes have to look around and try to copy everyone else. My question then, is there a list of common postures used in yoga (especially Hatha, Vinyasa, and Ashtanga) that I could memorize?"
  },
  {
    "selftext": "Hi all! I love yin and restorative for the deep stretching and meditation. I often hear from instructors about the benefits for the nervous system. Can anyone expand on that? How does it help your nervous system?"
  },
  {
    "selftext": "I have been doing yoga for about a month every day and the other day my boyfriend said to me \"I'm noticing a difference because of yoga, it's like you are slimmer and curvier at the same time\" and honestly it has made my week and has motivated me to make yoga apart if my lifestyle. \n\nAlso super excited that a lot of my back, hip, and shoulder pain is gone and that I can reach down and touch the floor when my legs are straight and my muscles are cold. Yay!"
  },
  {
    "selftext": "I have one of the milder forms of soft tissue arthritis, anklyosing spondylitis. I can't lift heavy weights without getting tendonitis; I've had plantar fasciitis for years.\n\nHowever, I'm pretty strong. I was a professional Pilates teacher and I take floor barre. I'm just looking for an additional challenge that won't aggravate the tendons and fascia in my shoulders and feet. What's the best way to get into power yoga without aggravating connective tissues?\n\nEdit:  The very first movement training I had was a year and a half of Iyengar classes with a very good teacher. I know basic yoga."
  },
  {
    "selftext": "I am able to do crow pose with my knees out to the sides of my triceps, but I find it nearly impossible to put them directly behind my arms. Is this still considered to be a \"proper\" crow, or should I keep practicing? I swear I think my legs are too long..."
  },
  {
    "selftext": ";) just for laughs :’)"
  },
  {
    "selftext": "I have been noticing that whenever I stretch my arms out to the side for long enough (like in warrior 2) they fall asleep. Is this something to be concerned about? I have had nerve problems in both of my arms for a year and a half and I am not sure if I should just let them fall asleep while practicing or be more carefull about that. Please let me know your thoughts."
  },
  {
    "selftext": "Two gyana mudra (index + thumb) joined together with the three other fingers. During meditation I was instinctively moved to create this mudra and was wondering if anyone else did this or is there meaning behind it?"
  },
  {
    "selftext": "I’m working on a series of poems based on the names and shapes of asanas, and I find that I keep returning to certain words (still, shift, breath). I’m interested to know, for you, and without thinking too deeply or reaching, what one word comes to mind when you think “yoga”? \n\nThank you, namaste ��"
  },
  {
    "selftext": "Context: very terrible week at work. Instead of yoga after work (which I usually do, 2 studio classes a week plus a home practice almost everyday) I just sat on the couch stewing in my misery. I knew I would feel better after yoga, but I just ... Couldn't? \n\nI'm going to try again today but it seems like when I'm actually stressed and need yoga my mind is like NOPE, binge eat peanut butter cups instead."
  },
  {
    "selftext": "Hello /r/yoga!\n\nI'm a beginner to yoga, and I have serious permanent damage in one of my shoulders.  Today as I was holding a down-dog I lost traction and slipped forward, straining my bad shoulder.\n\nRe-injuring my shoulder in a serious way is not acceptable.  $150 might be a lot for a yoga mat but it's a helluva lot less than going back to surgery.\n\nIt looks like the most common recommendations are natural rubber or cork.   What kind of mat do you use, what are your recommendations to ensure grip and stability in your poses?\n\n&amp;#x200B;\n\nEdit: I purchased a Jade Harmony, will try to update with a review"
  },
  {
    "selftext": "Some background: I’ve been practicing for over a decade and teaching for the last three years (I currently teach 6-10 classes/week). My focus is on teaching trauma informed yoga, especially to youth. \n\nThe studio I primarily teach at is offering its first 500 hr training this winter and the studio owner has been encouraging me to consider doing it. She knows that I had a really tough time of it with my 200 hr and did not enjoy the experience at all. Due to mental health issues I find it very, very challenging to be stuck in a room with a bunch of people I don’t know for hours on end. And while she’s told me she’ll make reasonable accommodations for my issues, I don’t like to do any continuing ed or trainings unless they directly benefit my teaching.\n\nI’d love to hear anything teachers here want to tell me about your experiences with doing a 500 hr training! What do you wish you knew before doing your 500 hr? Was it worth it- in terms of time/money spent and in terms of how you felt you’ve improved or changed as a teacher? Bonus if anyone also has mental health issues and how they manage to do trainings without losing their mind."
  },
  {
    "selftext": "Hi all, I’ve recently found out I’m pregnant. I’ve been practicing yoga for a long time and don’t want to have to stop. I’m worried about some of my regular poses being unsafe but I’m not impressed by what I’ve seen in prenatal videos. They mostly seem to be aimed at beginners who are in their third trimester, and look really boring and unsatisfying to me. \n\nCan anyone here recommend some more challenging classes that are appropriate during pregnancy?\n\nCan anyone speak from experience on what they needed to modify?\n\nI’d really appreciate any advice on how to approach this. Thank you ��"
  },
  {
    "selftext": "Honest question. Sorry if it's silly but what do you wear? A bathing suit or normal yoga clothes? I'd prefer to wear clothes but worry about falling in hahahaha thanks yall✌��"
  },
  {
    "selftext": "For those who go to physical classes, do you feel like your yoga progress is better than when you do it alone? I may be over complicating the hell out of it but I’m bringing the philosophy of boxing, my sport of choice, into yoga, where you wouldn’t recommend teaching yourself to box. I want to use yoga to complement the combat sports I’m in and potentially make me a hardier fighter, so I want to make sure I’m getting the most out of the practice."
  },
  {
    "selftext": "So I’ve been doing yoga since my adolescence and have had my hair at a variety of lengths, from short to long. Currently it is at its longest, down to my chest and is thick and wavy. \n\nHow all do people keep their hair back when they do yoga? Currently I use a braid down the middle of my back but this can be long, accidentally slip to smack me in the face, and often has bits straggling free.  \n\nWhat do you use? Should I just pony and learn to French  braid?"
  },
  {
    "selftext": "Woke up in the morning at 4.30am and was very refreshed I don't set up alarm clocks I have tuned myself to wake up. Woke up did my yoga practices basic yogaasanas,  sun salutation (Surya Kriya) and kriya breathing practices.\n\nWierd thing is that :\n\n1. When practicing certain postures there are sudden jerk of moments, sometimes in the stomach region but there are very obvious moments that is like I am doing a **penetration action** (FUCKING ACTION) that are involuntary.\n2. Secondly, I am very energetic calm and composed when practicing yoga but right after yoga when I start studying. There is a huge erection and I become lazy and tired. Then I go and lay on the bed still with erection on, I feel my body is trying to flush out the semen forcefully it is looking for ways to push out. Then after 30 mins or so I am back to normal.\n\nAdditional information :- while doing the postures **I breathe through my nose**, if lack of sleep was the problem but I feel refreshed and energetic while doing my yoga.. I am on strict **monk mode**, **vegan** diet + **no junk mentally** \\+ **noSurf**. It is my 60th day on noFap. This is happening for a quite sometime now."
  },
  {
    "selftext": "This has been asked before but it’s been a while. Can anyone recommend men’s clothes that would allow some flexibility to do some desk stretches but look professional?"
  },
  {
    "selftext": "Does anyone practice (or has anyone practiced) hot yoga (Bikram or flow) at a studio that doesn’t have showers? How much does it matter to you?"
  },
  {
    "selftext": "Hello! Little backstory from me, I graduated a ytt200 program in spring 2019. I hold a deep love for yoga and it's philosophy. However, lately I have not been practicing regularly due to transitioning to college and not being able to afford yoga classes. I normally practice 5 minutes a few times a week and in the meantime I have been reading more books on the philosophy of yoga, spending more time in nature, educating others through youtube, and journaling. I really want to get back into doing a consistent practice. I found that being totally immersed in yoga (for example, going on a retreat) has amazing effects on my mindset, and I wonder if there is anyway to continue this path of enlightenment at home with a regular schedule. \n\nWith that, I would love to hear the routine you have! All answers are appreciated!"
  },
  {
    "selftext": "Hi, I just had a surgery for appendicitis and therefore I  have to avoid using my abdominal muscles for a little while. It upsets me greatly as I can’t practice yoga for at least 6 weeks, which is pretty depressing. \nI thought I could build up a collection of poses that don’t engage the core - which I know goes against a basic principle of yoga- but it least I could still have a gentle practice in the time being.  All suggestions are welcomed :-)"
  },
  {
    "selftext": "Hello!\nSo I have been doin yoga for around maybe a month to pick my weight back up, and honestly it has been better than expected. I have been doing the yoga with Adrian videos (30 days of yoga and then moved to Revolution), but now they are too easy! My body is craving something harder, does anyone of a yoga routine that maybe better suited for me. Im regaining muscle, it comes much easier than the 1st time. I am also doing sprinting every 3 days. Please and thank you! ��"
  },
  {
    "selftext": "Got any great insta accounts of awesome people doing yoga? I love a good motivational account that gets me in the mood to move"
  },
  {
    "selftext": "So full disclosure I don't really practice yoga, but I was born with the flexability to naturally sit in the lotus position. I was wondering if there is any kind of office chair the kind with a gas lift and wheels for sitting like that. I have often taken the arms off my chairs but the base of the chair is usually too small or too curved to let me sit comfotably. I have pondered it myself for a while now but I thought I might as well consolt the experts ;). While I want to keep this general for others, I am 6'1'' so big is prefered and a back while not nessary would be a welcomed addition.\n\nThank you for any help Rendered,\n\nNargodian."
  },
  {
    "selftext": "Long story short I live with unexplained chronic 24/7 occipital pain and most likely some sort of central sensitization for years which roughly a hundred doctors did not diagnose successfully to this day.\n\nAs part of many other things I have been experimenting with in order to find anything that would improve even just a little bit my quality of life, I have been working for 3 years on my body strength and flexibility via yoga and calisthenics moves: back bridge, downward dog, crow to handstand, one legged squats, muscle ups etc etc\n\nRecently I tried the reclined bound angle position for the first time specifically because it is said to relieve the central nervous system. I had totally overlooked this pose because it did not offer any challenge and just seemed too basic. Boy was I wrong, totalling two hours of it a day really does calm my general body nervousity around my occipital pain, which I interpret as calming my nervous system / stimulating the rest and relax system in the most efficient way I have ever found.\n\nHence my curiosity and questions in the title."
  },
  {
    "selftext": "28M Electrician. Active.\n\nI have a very tight lower back that causes me agro when I'm bending over to pick something up, moving positions whilst sat down and sometimes even walking. It's super tight to the point where standing back up straight had to be done slowly and smoothly, it's not severe pain like breaking a bone it's more of an uncomfortable radiating stiffness that just slows my manoeuvrability.\n\nIt started around 4 months ago after I was surfing and the pain came and went and only really returned when I surfed. I then decided to take up yoga as a remedy and the results are amazing, I have no back pain what so ever.\n\nHowever the new problem rises when I take a few days off the pain seems to return and comes on even tronger. Is this common? It's like my body is addicted to the yoga.\n\nI attend at least 3 times per week on average but often attend 4 Mon - Thu. Weekends I'm out surfing. \n\nNow I don't plan to attend this much forever as I have other hobbies to work at, yoga was just a short term whim really that I would like to drop down to once per week, although now i'm not sure if that will be enough.\n\nWhat are your opinions on the matter?\n\nThanks for any info on advance.\n\nUpdate: Attended a sports PT and he told me nothing serious is going on but the prolonged surf sessions has agitated a lower disk and my muscles are cramping up to protect it. \n\nAdvised me to follow a few lower back strengthening exercises per day and maintain good posture. It should at least start clear up in the next couple of weeks. \n\nMobility is my friend and that Yoga should be continued at least twice a week.\n\nGood feedback really.\n\nThanks."
  },
  {
    "selftext": "Hi everyone, I was wondering if anyone jogs and also does yoga? Do you have a ‘regime’?\n\nI want to start jogging and was wondering if it’s a good idea to do yoga before/after jogging (for example as a warm up), or if it’s best to jog on a different day? Are they a good mix? Any thoughts or advice will be greatly appreciated :-)"
  },
  {
    "selftext": "I’ve never been consistent with yoga even though I know I should. I have APT and I can feel it’s effects on me now. My back in constantly arched and hips pointing down. I’m fairly tight all over so I need to loosen up in general but need to focus on my posture. Thank you!"
  },
  {
    "selftext": "The father of classical yoga, [Patanjali](https://www.yogajournal.com/wisdom/2208), made brahmacharya one of the five [*yamas*](https://www.yogajournal.com/for_teachers/984), or ethical precepts in the [*Yoga Sutra*](https://www.yogajournal.com/wisdom/462)  \\[Chapter 11, verse 30\\] that all aspirants should adhere to. Other yogic  texts name abstinence as the surest and speediest way to boost our deepest reserves of vitality and power."
  },
  {
    "selftext": "Does anyone know or have a link for video on how to address tight calves. i know  static stretching doesnt yeild  the best results due to it not permanently elongating the muscle so  thats why i want to try yoga for my plantar faciitis. anyone any insight on this?"
  },
  {
    "selftext": "I’d really love to get into aerial yoga however reading up on it lately, I realize I need to practice more before using any silks. Does anyone recommend any foundation poses in yoga to master before beginning aerial yoga?"
  },
  {
    "selftext": "I thought it might just be that my mats old but it was the same in a yoga class. Does it happen to other people and does anyone know how to stop it from happening, I might have to get a new mat?"
  },
  {
    "selftext": "At the yoga studio you have to take off your shoes. I’ve been susceptible to plantar warts in the past and am wondering what to do in this situation. I just got another one and hopefully can be rid of it faster than my last now I know how to treat it properly, but I’m frustrated at having to take a breather and do home yoga only in the meantime. \n\nHow do you prevent this?"
  },
  {
    "selftext": "I normally love YWA but lately I’ve been getting a little frustrated with her lack of consistency on both sides (since she normally goes by breath and talks in between instead of counting). But I do love her emphasis on self love, patience and growth not just fitness. Do you have any favorite videos (or channels) that balance the mental aspect while being physically challenging with a little less banter and more even on both sides? Ideally with a focus on core and at an intermediate level.\n\nThanks!"
  },
  {
    "selftext": "How often and for how long do you practice Yoga?"
  },
  {
    "selftext": "Is that a problem? I'm 24 and I feel like my bones shouldn't be shifting so much because I'm young. Thoughts?"
  },
  {
    "selftext": "Ram Ram\n\nI have spent all my life sitting in front of a computer and to add to it i was slouched during it all the time. \n\nI wish to fix my Temple now but i would love to hear some advice for Basic stretches + Taking into consideration that i am not even able to keep my spine erect for more than few minutes without shaking while having something against my back otherwise i am not even able to sit up properly because of the lack of my leg stretches. \n\nMy neck and head is used to being forward so much that my neck bones grinds alot. \n\nAlso any recomnendations for knee help would be appriciated as they hurt while trying to sit in lotus pose and it causes my whole leg to get numb. \n\nBasically I feel like the most static unmobile human being\n\nThank you everyone and Love you all."
  },
  {
    "selftext": "recently i been struggling with overthinking  whenever i read a  book study watching time etc i keep overthinking things happened things that will happen and other things outside of what am doing not that i live in the past but i cant focus on what am doing i think of RL things the conversation i had with my friend how i ll response to him  etc it just a nightmare\n\n i heard yoga can help so i hope u guy help me"
  },
  {
    "selftext": "I just moved from SF to NYC and am looking for a new yoga studio / instructor. I have fairly specific thoughts on what I'm looking for, so I'm hoping someone familiar with the scene can point me in a productive direction!\n\nI do yoga primarily as a way for me to improve my active range of motion and stabilization strength. I don't look to it for cardio or as a replacement for dedicated strength work. In SF, I was attending a relatively slow paced vinyasa class with [Jason Crandell](http://www.jasonyoga.com/).\n\nThe things I liked about Jason's class (in rough order):\n\n1. A heavy focus on form and cues\n2. Good knowledge of sports science that he applied to improve his yoga instruction\n3. Deliberate pace\n4. Thematic areas of focus that span multiple weeks\n5. Totally non-spiritual / does not include chanting\n\nI'm living in Flatiron and working in the Financial District, but I'm pretty happy to check out anywhere that's near a subway line in Manhattan (and plausibly Brooklyn / LIC).\n\n\\[cross-posting from r/AskNYC to get hit the community from another angle)"
  },
  {
    "selftext": "Hello everyone! \nI'm a starting yoga teacher (been teaching for a few months) and I have found that many of my students really open up after practicing. To me Yoga always helped calm my mind and focus, but also be more contend in general. It was one of the main reasons I was always able to return to it.\nDo you know more about this connection or some place where I could learn more about it? What are your personal experiences with this? Has Yoga helped you with something in the past? \nI'm looking forward to reading your stories!\nNamaste\n\nEDIT: I do not, in any way, encourage to choose Yoga as a go-to tool to cure any sort of mental illness. While it might have stress relieving effects it is not sufficient to deal with serious psychic problems. If you think you might be suffering from those, please seek professional advice."
  },
  {
    "selftext": "I am struggling with transitioning from crow to handstand, no matter how hard I try I cannot get my knees to leave my elbows, I don't understand the mechanism, or there's some strength lacking or something. \nI can handstand press fairly easily but crow to handstand seems impossible, does anyone have any tips?\nI can do one legged crows without too much trouble too. Help?"
  },
  {
    "selftext": "https://www.neodata.com/yogajournal/Pain-Free-Practice.pdf\n\nThe information in that link will be very accurate, zero mistakes."
  },
  {
    "selftext": "It’s definitely an orange scent, but all the orange air fresheners and diffusers I smell in stores are more citrus-y than orange-y, if that makes sense. I moved faaaarrr away from the core power yoga I used to go to and just like the scent because that was where I first got started in yoga so the scent brings back lovely (and calming) memories. \n\nIf anyone happens to know what they use, I’d really appreciate it for my practice ����"
  },
  {
    "selftext": "I had never done any yoga but my physical therapist has given me  a course of 17 stretching/yoga exercises to do daily. Most are to do ten times for ten seconds and then do twice. I had to do one in the morning and one in the afternoon at first but now I am strong enough and healed enough to do all in one session.  \n\nI am not sure it matters greatly but should I do one set, rest, then the second set or go through the entire routine once and then repeat.?  Obviously not a burning question but I was curious.  Thanks"
  },
  {
    "selftext": "Hi everyone,\nSo my studio will be closing for a three week summer break starting next week. Rather than paying for additional individual classes at another studio, I thought I would take the opportunity to build a more regular at home practice. I usually go to class once a week, and have been wanting to practice more often, but classes are expensive. I sometimes practice at home with YouTube videos.\nMy question to you guys is how did you develop a regular and steady at home practice ? Did you go straight into \"from now on I will practice an hour everyday\" mode, or did you gradually increase the number of sessions you do weekly ? Do you think it's better to practice 15 minutes every day or 1 hour 3 times a week for example ? I would love to develop my practice  but often struggle with keeping up with good habits."
  },
  {
    "selftext": "I asked my yoga teacher this morning if my plank form was correct and she said it was but idk I don’t feel it in my core when I’m pkanking... \n\nSo wrists under shoulders, suck in tummy, dome back and extend head and heels?"
  },
  {
    "selftext": "Hi guys! New to the page, couldnt find anywhere that could give me the information i wanted so ive turned to you guys! \n\nIm looking to complete a yoga instructor course, unfortunately as much as i would like to dedicate time to attending a classroom/studio based course. I still have to work full time and most of my evening's are fully booked. So online seems like a good option and so far ive read good things ! \n\nI was wondering if anybody had any experience with online courses ? Or if somebody would suggest a specific one for a UK resident, as there are so many to choose from!\n\nAny info would be appreciated!\nThanks guys :)"
  },
  {
    "selftext": "Lookingfor a good book!"
  },
  {
    "selftext": "What can I do to relieve a tight obturator internus? It’s a difficult muscle to get to."
  },
  {
    "selftext": "Looking to get out of my comfort zone and sign up for TT in a different state at YogaWorks. \n\nWill try to attend a class to get a feel for it beforehand, but just wondering if anyone else has done their TT with them."
  },
  {
    "selftext": "Hi all :) \n\nI'm starting along the teaching path, and curious to hear about what people like in their yoga classes, at any level of detail or abstraction you might feel like providing. I know that people look for lots of different things, and I'm intrigued to hear some perspectives that I probably haven't thought of yet... \n\nMany thanks, and Namaste!"
  },
  {
    "selftext": "My step is always too short and I have to use my hands to adjust my foot a little further away before getting into a high lunge or warrior poss.  I feel it could be because my legs are long, but I’d love for that step to be the perfect distance."
  },
  {
    "selftext": "Hi, whenever I dedicate a few days/weeks on working on my shoulders they seem to become sore. For instance, I can quite easly grab my hands behind the back (as in gomukasana) but after a week of shoulder opening exercises it feels much harder and painful! \n\nI don't do particularly hard shoulders opening exercises (pretty much standard stuff) and I don't get that kind of \"rebound\" sensation in any other joints, that I usually push much harder.\n\nHas anyone experience something like that? is it something specific to the shoulder joints or just me...?  \n\nMany thanks!"
  },
  {
    "selftext": "And it did not went well. After only 50 minutes I felt not only dizzy but I got the feeling I had to throw up. I had to lie in savasana for the rest of the class (another 40 minutes).\n\nBut I really really liked te poses, the heat, the stretching and want to continue. Is this normal for a first lesson? Are there some tips to prepare for a bikram lesson (eating, drinking,...)?"
  },
  {
    "selftext": "I started doing yoga and breathing exercises in addition to working out about 8 months ago. At first it started out great but eventually I started getting random annoying injuries and this has derailed my exercise routines. \n\nI started doing these exercises because I went to the docor with trouble sleeping and breathing and was diagnosed with depression?? \n\nHere's the kicker. I have some really flared ribs, but they're not flared because of muscle weakness or anything they're completely deformed. So as I'm looking into breathing exercises I noticed that it seems like I've always used my chest and shoulders to breath. So when I try to use my diaphram to breathe I get like half a full breath, maybe a little more.\n\nMy question to yogis is, can deformed ribs be the cause or affect of a dysfunctional diaphram? What sort of doc would I see to check this sort of thing out. \n\nIt's to the point where the orthopedic has me going to physical therapy for shoulder pain and I'm getting an mri on my shoulder but I don't think that is my issue. The np (still haven't actually seen the doctor because I'm pretty sure they just think I'm making this up) keeps telling me they can only treat pain but... It's not painful, I just can't breathe properly?? \n\nSo in practice have you seen any rib deformities impact the ability to breathe properly?"
  },
  {
    "selftext": "There has been a lot of coverage about how too many symmetrical poses can be bad for joints. But what about how asymmetrical poses are added to and used in a practice? \n\nI keep encountering practices that have down dog go into lunge, and then a long series of lunge stretches on that one side for at least five minutes (might include high and low lunge, crescent, warrior, peaceful warrior, triangle, etc.) and holding each for a good amount of time, before going back to down dog and doing the other side. Is it general practice to do all one side, and then the other? How many poses are standard or too many?\n\nWhen I practice yoga, I am usually the person who finds the \"hard\" poses easy, and some of the standard poses hard, so it makes it difficult to determine what issues are mine, and which are the practice I'm doing. Doing all one side doesn't lead to later pain, but it does lead to strain and cramping during the practice, because the lunge is held for so long, rather than, for example: half right, half left, half right, half left.\n\nSeeing that asymmetrical poses can lead to serious issues in general, it makes me wonder about these long series of lunges. Thoughts?"
  },
  {
    "selftext": "thank you!"
  },
  {
    "selftext": "Hello yogis.\n\nSo, I've posted a few times here for advice as I grow my personal practice and the community has been wonderful, so here I am again!\n\nMy hamstrings are insanely tight. Not like \"Oh my hammies need a little extra stretch today.\". Like \"I can't sit up with my legs extended without arching my back. Like, at all.\" Can't touch my toes, can't flat back, etc.\n\nIn a previous post, a teacher asked how my low back was feeling during my forward fold. Well, my back always tingles/is sore after my practice but I figured that was a natural asect of movement. Yesterday, I did my routine with no forward folds/tabletops and my back didn't hurt. It was still \"open\" but the specific pain sensation in my lower back wasn't there, which means I'm so tight, I can't even do micro forward bends without immediately jacking up my low back. So, two questions:\n\n1. I was using forward fold to try to legntehn my hamstrings, but I feel like I'm doing more damage to my low back than I am doing good to my hamstrings in that position. The only hamstring opener I've found that doesnt hurt my low back is down dog with knees heavily heavily bent (basically in a spider stance.). Are there any other poses I should be looking at that could stretch my hamstrings without putting pressure on my low back? (I can't do seated postures with legs extended, and I tried feet up the wall put it made my calves hurt and for some reasons I started getting twinges with my achilles.) Or, should I just stick to foam rolling until I undo some damage?\n\n2. I like doing guided vinyassa videos in the evening. What should I do when they say \"forward fold/flat back.\"? Should I just stand up? Should squat down and fully collapse over my knees with my back rounded? Should I only go down an inch or two forward, which is about as far as I can go maintaing a flat back and I'm not joking there. For flat back should I go all the way down into almost a crow pose and hang out there? What are my options or suggestions?\n\nThank you in advance! Namaste!"
  },
  {
    "selftext": "TLDR; Looking for an at-home yoga program that has a holistic yoga approach suitable for beginners.  I'm **specifically** looking for a program that offers spiritual/lifestyle guidance as well as the physical practice.\n\nHi all,\n\nI want to develop an at-home yoga practice (and will also be taking some classes locally). I have dabbled in yoga by attending classes here and there, but these are typically community classes at my local fitness center, which are good, but I know that yoga is a multi-dimensional practice, and I want to build mindfulness and inner peace, not just go through the flows. As a secular Buddhist, this is especially important to me. A lot of the classes I've been to don't really focus on anything but the poses, because I live in the American south, and I think the instructors are iffy about going all Eastern philosophy on a bunch of Baptist ladies. :D\n\nDoes anyone have a suggestion for an at-home yoga program, either on the Internet or via DVD, that has a holistic yoga approach suitable for beginners? I have been doing Kirtan Kriya meditation, but I'd like something integrated into a physical yoga practice, if such a thing exists. I'm **specifically** looking for a program that offers spiritual guidance as well as asanas.\n\nThank you in advance!"
  },
  {
    "selftext": "I recently realized I've been pronating my shoulders when I go into chaturanga dandasana. Can anyone here offer any advice/recommendations on ways to think about shoulder placement in chaturanga? Can anyone offer any shoulder exercises I can do outside of yoga in order to prevent this pronation? \n\n(Side note- it probably doesn't help that I sit at a computer at work for much of my day!)\n\nIf anyone is able to offer any additional insight into the anatomy behind the shoulders in chaturanga, that would be appreciated. I've been wondering if I also have weakness in my deltoid muscles or upper/mid traps that are contributing to this shoulder issue.\n\nThanks for reading!"
  },
  {
    "selftext": "Anyone have any tips for getting your weight back (off your wrists) for down dog? I seem to do okay if I’m coming from a standing pose, but if I come into down dog from plank or vinyasa, I can’t seem to get my weight shifted back. It’s caused some pain in my wrists."
  },
  {
    "selftext": "Question for All Yogi's here. As a guy Yoga Teacher. I am shy to ask this or even attempt. I find my awareness is better in tights than shorts and a tee. Would it be acceptable for a guy teacher to teach in tights or not?"
  },
  {
    "selftext": "Why is some hands in the air, and some in prayer, what does this represent?  Thank you!"
  },
  {
    "selftext": "Hi all, apologies in advance if this isn't allowed here. I'm looking for new leggings for yoga because my FAVORITE pair is getting worn. I don't know what brand my faves are, they have a logo of someone in scorpion pose which I can't find anywhere else. Does anyone know this brand, or know of other breathable, super soft leggings?"
  },
  {
    "selftext": "Hi yogi's. \n\nI want to learn how to do a handstand, I can already do the most basic way, legs bent with knees resting on elbows, and would like to attempt one of the many many handstand challenges online. \n\nMy question is have any of you done any of these challenges (28, 31 or 6week) and had any luck? And which videos/ websites would you recommend? \n\nThanks."
  },
  {
    "selftext": "As a means to remedy my bad back and general inflexibility, I've been participating in a hatha yoga class for the past six months. It's been life-changing.\n\nObviously I'm not an expert at this yet and unfortunately, my work is taking me away from the teacher and class for the coming months. I want to keep practising my asana's, they're doing my back a world of good. \n\nWithout a teacher to show me and correct me, I'd like to have a book I can use to stay fresh on each position and as a reminder for which muscle groups each asana focuses on.\n\nIn this particular case, I'm not too interested in the philosophical side of yoga. Just a practical guide with a step by step of important asanas and an explanation on which parts of the body they're supposed to stretch or strengthen. Additional information on how to do simplified versions of asanas I can't quite manage yet is also welcome.\n\nSo if you have any recommendations let me know."
  },
  {
    "selftext": "I’m teaching a Hatha class in about an hour, and I’m feeling completely uninspired by the plan I made last night. If I stick to my plan I know it’ll just feel wooden, so now I’m at loose ends.\n\nPlease inspire me with a target pose or theme! What is your body asking for today?"
  },
  {
    "selftext": "Just curious why in most yoga classes there seems to be more emphasis on staying in down dog for several breath counts vs e.g. in up dog? Similarly there often seems to be a larger focus on forward folds. I'm just wondering because in our sitting-too-much world, it seems like holding the extension positions would be more beneficial. Is this maybe due to needing to adjust focus given changes in our modern world?"
  },
  {
    "selftext": "Hi. \nSo, i have what is known as knee valgus, which is somewhat common, i've heard. \nThis is where your knees cave inwards, and where the knee is not perfectly aligned with the foot. \n\nIs there anyone of you with knee valgus (knees caving inwards) that have gotten better with yoga?\n\nThank you for your help."
  },
  {
    "selftext": "What daily yoga exercises would you guys recommend for someone who does CrossFit? Looking to loosen up after workouts before bed. Struggle with tight hamstrings and tension in shoulders,traps,neck. I currently use yoga with Adrienne on YouTube and like her videos any particular session that may help? Thanks for any advice!"
  },
  {
    "selftext": "Hi,\n\n&amp;#x200B;\n\nI recently completed my 200 hour certification and am teaching my first class this Saturday. I am so nervous and excited at the same time. Does anyone have any tips on teaching a successful first class?"
  },
  {
    "selftext": "To force yourself to practice when you're just not feeling it (even though you want to and know you should) OR to suck it up and go to class (knowing that you could either come out feeling better or even more blah)?"
  },
  {
    "selftext": "Yogis, teachers, and/or at some-point-pregnant folks - what do you think are the most important modifications (from a safety point of view) when transitioning from regular to \"prenatal\" yoga?\n\nI practice vinyasa and ashtanga both in studio and at-home settings, and now that I'm expecting a baby, I have also enjoyed some prenatal classes. In prenatal classes instructors often seamlessly make those modifications to poses so I'm not always aware that something is different for a specific reason. So I'm looking to learn more about specific things I MUST adjust when practicing on my own.\n\nBeyond issues of some things being not feasible or not comfortable (e.g. not lying on your back or needing a wider stance folds), are there certain movements or poses that are considered DANGEROUS in pregnancy? Or is it feasible to continue your regular practice and adjust by listening closely and seeing what feels right? \n\nThanks so much in advance for your advice and input!"
  },
  {
    "selftext": "I don’t see a weekly update type posting on this sub but I am so excited I needed to share. I went to a vinyasa class today and the instructor is one of my favorites but I rarely get to her class. We started working on a flow that ended with One Legged Crow II. I never made it in class but stayed afterwards and I did it twice and held 10-15 seconds each time. I broke my wrist 25 years ago and felt like I would never be able to do any crow poses. I am over the moon happy."
  },
  {
    "selftext": "Hi /r/yoga,\n\nI'm a newbie to yoga, but I lurked a lot.\n\nStarting my practice I noticed I have major stiffness in mostly all the posterior chain of muscles, mostly on the legs (hamstrings and calves so stiff that my ankle's movement is very limited).\nI also have a very tight psoas. When I try, for example, the ananda balasana i feel like a blade stuck in my hips.\n\nI've found on this sub a very interesting tutorial on how to address hamstrings tightness. Could you please help me release the other muscles as well?\n\nThank you."
  },
  {
    "selftext": "Hi yall, I just moved into a new house and currently the only spaces i have for yoga are on carpet or concrete (the home gym is concrete). \n\nBoth options imo are less than ideal: my mat slides on the carpet, but I'm a little nervous about falling onto *concrete*.\n\nI use [this mat](https://shop.lululemon.com/p/women-mats-props/The-Reversible-Mat-5/_/prod6750166?color=38389) because i have a permanent foot injury from a botched surgery &amp; prefer the extra padding. \n\nAny suggestions are welcome! Im likely going to be in this house for a little while (but less than a year), and yoga keeps me sane, so I don't mind investing some money."
  },
  {
    "selftext": "Hello! So I’m going to be adding carpet to my living area, because my rabbit keeps slipping on the floor. However, I live in a small space and this area is really the only place I can do yoga. Do you guys think it’ll work putting my mat on a carpet?"
  },
  {
    "selftext": "Hey guys, I’m new to yoga and I’m trying to find a starting routine to do on my off days from rock climbing and weight lifting. With those communities, the resources for progression are handed right to you and I guess I was expecting yoga to be the same. I can’t afford classes so I wanted to train and progress at home. Is there a recommended routine to follow? I was interested in Ashtanga and Power styles as I’m looking for something intense"
  },
  {
    "selftext": "Hey, I am 19, at present I intend to pursue yoga as a fulltime job, i like teaching yoga and i got certified a few months back.. I am training at a gym for now and teaching in indian gyms isn’t a fun task.\nI desire to take up private yoga clients and i am quite stuck how and where should i start. \nI soon will be studying fashion as a grad  and i always longed to do so either in EU or USA.. which takes a lot of money and because of the funds I had to skip a year or two... I planned to earn money on own rest maybe bank...\ncan somebody help me guide or a fews tips to start off yoga as a business.\nNamaste\nSending calming energies to all"
  },
  {
    "selftext": "Looking to do a yoga retreat next year in SouthEast Asia, any recommendations on places or companies to check out?? Open to anywhere!"
  },
  {
    "selftext": "I've found since starting yoga over a year ago that sitting in chairs without good lumbar support (like car or movie seats) and laying flat on my back both get very uncomfortable for my lower back after an hour.\n\nI never had this problem before yoga and am wondering if backbends have had a negative impact rather than a positive one? I'm not super bendy or anything so it doesn't seem like that should be the problem, and yet I do think it's weird that this began when I started yoga."
  },
  {
    "selftext": "How can I lift my leg more in birds of paradise? I can lift my leg maybe to my hip height but can’t go any higher. Any tips?"
  },
  {
    "selftext": "I've been browsing yoga videos/photos this evening and I have a question about extended side angle. \n\nAt my hot yoga studio, during extended side angle, the instructors cue either a) both arms up in the air raised above the head or b) top arm up over head and lower arm reaching forward (palm up). \n\nWith these cues, I've always considered extended side angle to be a pose targeting core/obliques. However, looking at photos online I am actually seeing the lower hand being placed on the floor.\n\nSo, is extended side angle designed to be a stretch with the hand on the floor or a pose targeting the core with arms up in the air?\n\nI think this question can also apply to revolved triangle. Studio instructors at my local studio usually cue something like \"your lower arm/hand can be placed next to your front leg. Should I go ahead and place my hand on the floor in these poses if that is accessible to me?\n\nThanks for reading!"
  },
  {
    "selftext": "The studio where I practice will frequently do inversion play time towards the end of the class when space allows (the classes are all level, so they do this only when there's room for people who need/want the wall to move their mat around, etc).  \n\nThe class I was in yesterday did this, and there was plenty of room. I took a headstand where I was, as I can get up and down in a controlled way without extending beyond the confines of my mat, and was still within legs-reach of the wall if I needed to tap a toe or whatever. Other people moved around, either to be closer to the wall, or create some space if they were experimenting with something new.\n\nThe guy next to me, however, decided he was going to do some wide-legged handstand variation, so he was aligned perpendicular to where I was, so that he could start with both feet on the mat, and did not choose to move his mat at all. So as he worked to get up, his feet were hovering inches from my upside down face, and he was blocking my whole mat, in such a way that had I needed to come out of my own pose, I could not have done so. At one point, he actually just put his feet down on *my* mat so that he could adjust his alignment, so he clearly knew exactly where he was. When I did have an opportunity to come out of the pose, I did so, but still didn't feel comfortable even resting in child's pose, because I was worried this dude was going to land on my back. \n\nIt was so frustrating in what's usually a grounding, relaxing time before savasana. It felt both not safe, and super rude, for no reason. Am I being fussy? Is this a common practice elsewhere?"
  },
  {
    "selftext": "Good morning yogis!\n\nI'm currently practicing at an intermediate level, and I don't think I have any  issues with the strength required for the various planks, but I'm finding that being cued from forearm plank, to forearm side plank and then back to forearm plank again is irritating my elbow. A few hours after practice, I get a twinge whenever i fully extend or contract my arm.\n\nCan anyone help with either tips to reduce the strain on that joint during the pose, or with advice to strengthen it?"
  },
  {
    "selftext": "Hey guys, came here specifically cuz I can't figure out what I'm doing wrong.\n\nWhenever I do a standing balance pose where I have to lean forward (ex. warrior III, standing split) I get an intense painful cramp in the outer hip of my grounding leg which causes me to lose my balance/fall out of the pose etc. It's almost instant all of the time whenever I try these poses. It doesn't matter if they are closer to the beginning or end of my practice or whether I have stretched them out yet or used them at all or not.\n\nEither way I would like this to stop happening so I can progress in these poses.\n\nAlso in other balance poses (dancers, eagle, extended tree) the outside of my grounding ankle burns, is that normal? I can usually breathe through it but it is rather painful.\n\nThanks!"
  },
  {
    "selftext": "I'm new-ish to yoga (on and off for a couple years) but everytime I work on inversions or even some planks/oblique things- keeping my hand at a 90° angle is extremely painful on my wrists ( I have broke both wrists) usually I can work through it for awhile but it gets so bad that it hinders me from getting too advance the moves. Also they end up a little swollen. Is it the way I am doing the poses perhaps? Maybe it's form or is it something everyone deals with or is there a way to get them stronger?\n\nSub note: I have tried making a fist and it doesn't help"
  },
  {
    "selftext": "Since I started a few months ago, I've had really great balance and able to hold some tricky poses really well. But my mind had always been in a really good place. \n\nToday I had a lot on my mind that I just couldn't let go of and I was really surprised how much I stumbled through the practice, had no balance, and generally felt like giving up on anything challenging.\n\nIs this pretty common? Any tips for getting focused when this happens? Focusing on breathing just wasn't working."
  },
  {
    "selftext": "I’ve been practicing on and off for about two years and have recently been trying out more poses involving the shoulder and upper back muscles. However, when I work on it, I get unbelievably sore the day after, so much that I can’t even lift my arms at all. This is really bad for\nme because I am a serious violinist and I can’t really afford to be that sore every day, or even once in a while. So, I want to know, are here any tips to prevent this soreness from occurring? Or do I just have to tough it out?"
  },
  {
    "selftext": "This is not an ad. At least it's not my ad! One just popped-up in my facebook feed and i was wondering if anyone else's reaction is the same as mine. How can you become a certified yoga instructor from an online course? I'm a big fan of online learning - I've done many courses through universities, Udemy, and other websites. But I can't help feeling some human interaction is required to become a yoga instructor - some hands-on interactions with other people. How are you meant to teach adjustments via a computer / video!\n\nTo me these kinds of programs are dangerous, and devalue regular yoga teacher training. And I don't care if you've got a PH.d!"
  },
  {
    "selftext": "Hi all,\n\nI’ve done yoga on and off for years- usually leaning towards vinyasa, flow and yin/yang. Due to some mental health issues and a medication change, I gained 60 lbs over the course of about a year and a half, which I am now working to get off via diet and exercise. \n\nI really miss yoga and would like to get back to it, so I’ve started the 30 days of Yoga with Adrienne. As much as I like her, and feel better overall after a practice, OH DEAR GOD are some things uncomfortable, to the point of pain- my knees hurt in cat/cow, my freaking butt bones hurt in boat. While I truly believe plus sized women can do yoga and kick ass at it, at this point that extra sixty lbs feels like it’s killing me! I should mention too that this extra weight puts me in the BMI category of obese- a size 16-18 at 5’5. On my frame it is very uncomfortable and as stated, it is something I’m working on to better my health. In the meantime though- does anyone have any suggestions? Practicing on a thicker mat didn’t seem to make a difference. Am I resigned to avoiding these poses until I can reduce the strain on my joints by losing some of this weight?"
  },
  {
    "selftext": "I am relatively new to yoga, I have done it here and there. I really enjoy the stretch/workout I get when I try new things. The problem that I continually have and ultimately demotivates me to do better is that I can clear my head space. I seem to lose focus to my anxieties and other worries, I'm looking for a little guidance on what I can do to regain focus while in practice."
  },
  {
    "selftext": "And remained completely composed in posture. Nobody laughed.\n\n༼ つ ◕_◕ ༽つ FOCUS DONT ��༼ つ ◕_◕ ༽つ"
  },
  {
    "selftext": "It seems like the only option for a long lasting Yoga mat is Manduka, but there are \\_so many\\_ negative reviews saying that they cannot get rid of the stickiness. Yet there are people saying they have success breaking it in as well. What is with the bi-polar reviews?\n\nCost is a non-issue but I only will really use the mat 2-3 times per week. Also I live in a small studio and can't just hang my mat out in the sun and do these salt scrubs in a small apartment.\n\nIs it going to take me 10 years to get this thing to a useable state before I can use it if I buy one?"
  },
  {
    "selftext": "Hi /r/yoga!\n\nIs out there an esoteric yoga school which not only teaches the common tennets of yoga (that we can get in every possible way on the web), but also gives an initiation to the most concealed principles of yoga?\n\nThanks."
  },
  {
    "selftext": "I’m 9 months in, 2-4 times a week with everything from restorative to hot vinyasa.  I have lots of upper body strength, so I can fully experience and enjoy poses that rely on that aspect of me.  Tree pose on my right leg?  I could fight off at least 3 toy poodles and maintain it.  I could take over a small country on my right leg.  On my left leg I become the leaning tower of Pisa. If someone gently coughs, the slight gust of air blows me over like a feather.  I become as unsteady and shaky as an 8th grader trying to get to second base, even when using my right foot as a kick stand.\n\nMy enlightened teachers say things like, “that’s where the yoga begins” and “yoga isn’t about ego.”  I used to spiritually appreciate the tasty karmic humble pie that left-legged tree pose serves up.  I even go stand by the wall when this nemesis pose comes up to symbolically declare to the universe and my fellow yogis that I suck at left-side tree pose.  I get the sun/moon, yin/yang, male/female thing.  But I’m a Libra and I need symmetry!  I even practice in my kitchen or in line at the store.  That being said, after 9 months of little progress, I surrender!  I think I’m doing all of the fundamentals correctly.  What else can I do?"
  },
  {
    "selftext": "I'm a brand new yoga teacher and I already have people asking me about private yoga. I know rates differ based on location, time frame, intent, etc, but trying to find general ballpark numbers online is harder than I thought. I'm seeing numbers ranging anywhere between $15/hr and $75/hr.\n\n&amp;#x200B;\n\nDoes anyone here teach private yoga and if so, what do you charge per hour? Do you give free consultations? Also, if I'm a new teacher and charge a more reasonable rate because of this, will it then be too difficult to raise prices as I gain experience? So many questions about this. I want to give people a reasonable deal but also don't want to lose money, especially if I end up traveling a lot. Any insight into this is much appreciated!"
  },
  {
    "selftext": "I've been practicing yoga on and off since the 1990s and my original instructor was trained in Kripalu yoga. The five years I practiced with him really set the foundation of both my love of yoga and my understanding of my body, poses, etc. In my area, the only studios nearby are vinyasa flow studios. I've tried for years now to embrace this style of yoga and I've finally decided that it really isn't for me. I deeply miss the micro movements of exploring postures and the slower pacing of Kripalu yoga. I've looked and can't find any Kripalu instructors in my area. Are there online options for that are high quality for doing Kripalu at home?\n\nI'm also a little curious if anyone has any insight into why Kripalu practices are so rare. I'm in a large metropolitan area on the East Coast, you'd think everything would be available here!"
  },
  {
    "selftext": "Hello everyone,\n\nSo I've come to realize that I've been breathing wrong my entire life. I just recently started breathing the correct way and my shoulders and neck have started to really Crack and my posture is getting a little better. \n\nI was paradoxically breathing into my chest using my neck and shoulders. Now that I'm using my diaphram I'm pretty sure all the muscles I WAS using are now loosening up and it feels painful/relieving. I'm really just looking for any info or experience with this.\n\nI've also been trying to increase flexibility in my spine and intercostals where I can. \n\nThis has come with some very strange head rushes and my vision even seems to randomly get better, but noticibly so. \n\nBy doing yoga and stretches and what not can you unlock ribs bones and nerves that could be causing this?\n\nThanks for any advice tips or pointers!"
  },
  {
    "selftext": "I'm on day 21 on Yoga with Adrienne's 30 days of yoga series and I'm really enjoying myself! Since the series soon will be over I'm hoping someone could recommend me where to go next? I don't want to lose this momentum that I've built or lose this new habit of mine. I want to continue doing at least 30 minutes of yoga every morning.\n\nAs the title says I started with yoga as a compliment to my meditation practice. I'm more interested in yoga that emphasizes breathing and body awareness, a more spiritual approach, then the more fitness oriented yoga. I think Adrienne hits a nice entry level here.\n\nAny advice is greatly appreciated"
  },
  {
    "selftext": "So I come from a weightlifting background. I’m 38, male, a bit overweight and have some lower back issues. I have never been flexible. Like, I can’t even sit in the floor comfortably. I’m ready to get back into trail running as my main hobby. The issue I’m having is finding time to work a full time job, spend time with my family, trail run, lift weights and do yoga. I’m honestly ok with losing some weight/size and even strength if I have to. My goals are primarily to get better at trail running, feel better/not hurt so much, and to look halfway decent naked. I guess deep down, I just want to be functional, happy with myself, and a source of positivity for my family. Thanks for any advice."
  },
  {
    "selftext": "I practice most days a week but attend a yoga class once a week.  This class is going to be transitioning to a Universal Yoga style class.  I've done some googling but don't really grasp what makes it different.  Anyone have any insight? (For the record I'm going to keep going, the instructors are great and the time/location is A+)"
  },
  {
    "selftext": "I’m relatively new to taking yoga classes. I happen to be loving my local studio and have taken classes for several months. No instructor has used any incense or essential oils... until last week. The instructor without any warning at the start of class sprayed an essential oil spray which immediately gave me a sinus migraine. He was apologetic but I had to leave. The studio was very nice when I spoke to them, and told me they would remind the instructors to ask prior to using any scents. \nI’m curious if asking students prior to using scents is common in yoga studios. I understand that for some it’s an important part of their personal practice. However, when paying a lot of money for classes, I would think that the health and sensitivity of the students should be taken into account, and think the instructors should ask about any medical conditions and sensitivities before class starts. \nI’m curious as to your thoughts on this."
  },
  {
    "selftext": "Can anyone recommend a youtube channel or a yoga resource that places no physical demands on the body?\n\nI want to supplement my sports training with yoga, but, tbh, it takes too much out of my recovery. By the time I'm finished, my limbs are exhausted and my nervous system feels more taxed than ever.\n\nI want something with poses that I can just flop into and feel the stretch, without having to support my bodyweight at all. I don't want to add another training day. I want to add a day or two of stretching that won't interfere with my recovery from my real training.\n\nThanks in advance."
  },
  {
    "selftext": "So I’ve never done hot yoga before and I’m kind of insecure about how my excessive sweating will affect the session. I’m pretty sure I have some sort of disorder like hyperhidrosis or hyperthyroidism because I sweat profusely after even the smallest workout. I’ll be at the gym punching the heavy bag for 20 seconds and my clothes are literally soaked in sweat and my shoulders, face, and chest are glistening. Then I look around at the other people who have been training for longer and they haven’t even broken a sweat. So I guess my concern is, admittedly, what others will think of me during hot yoga. I know I shouldn’t care but I do. \n\nAre most people this sweaty during these? I also feel like the people who are going to hot yoga are generally people who are gonna be pretty open minded and non judgmental for the most part. Lemme know what you guys think!"
  },
  {
    "selftext": " One of the issues that comes up as a yoga practitioner is the relationship between yoga and pain and whether yoga in itself causes bodily harm. I chose to start with the first topic. Most of us come to yoga for various reasons. Some practitioners come because of pain in the various parts of the body and it is undisputed that yoga helps these pains. But what about those \"healthy\" practitioners who have been suffering for months in various body parts while practicing yoga? One of the answers I received from a knowledgeable yoga practitioner is not doing the asanas right, which is the reason for the pain. Or, yoga does not cause pain. Indeed? I started researching the topic with great interest also as suffering from a back pain (every time elsewhere) after yoga practice and also because of being a doctor. I will write down my views and conclusions below according to the comments I receive on this post. thanks!"
  },
  {
    "selftext": "Hello! I am a Male of 25 year old with weight around 130kgs (286 lbs).\n\nI have Knock Knees Since the Childhood and it feels like it has gotten only worsen over the time since I'm obese (overweight).\n\nPicture of my Legs: https://i.imgur.com/nkgQCwa.png\n\n\nI have some questions if anyone could answer me and help me with my poor condition.\n\n1. What are my best options at this point seeing all the information?\n\n2. Are their any non-surgical corrective measures to fix this issue? (Like exercise, yoga or physical therapy).\n\nThanks."
  },
  {
    "selftext": "Everything I see suggests that the shin should be perfectly parallel to the top of the mat... but I can't really do that. If I bring my knee closer to 45 or so I can fold over all the way comfortably and keep my hips aligned. Is this wrong? Is it a different muscle? How can I improve if this is incorrect?"
  },
  {
    "selftext": "Hi all,\n\nFor a long time now, I've had an issue that I have put down to bad/inappropriate posture. \n\nUpon standing, I get a whooshing sound in my ears, like a raised pressure in both ears and the sound of blood pounding upwards. There's a marked increase in heart rate, too. It's not every day, but when it happens it's 99% of the time towards the end of the day.\n\nWith this, I get dizziness and sometimes a faint feeling – never fainted from it. When I'm having these issues, I'm always extremely tight around the neck, shoulders and upper back. At it's worst, it's accompanied by tension headaches.\n\nAs a small business owner, I sit and work long hours in-front of a computer screen. So I think this is the cause of my issue. I've been for multiple doctor checkups and had all sorts of tests done. Everything comes back fine.\n\nThis has been an issue for about 6 years now. It is sometimes worse and sometimes better. The times when it's better, I'm observing better posture, using a standing desk, doing yoga regularly, etc etc. And all the things you'd expect. It's also better after a shower (heat and muscle relaxing, I guess).\n\nOver the years, I've tried yoga, massage, acupuncture, myofascial release &amp; massage/lacrosse ball work, etc etc etc.\n\nI've given up stupid posture decisions like working on a laptop late night on a couch! \n\nSo my questions for you:\n\n- Have you ever had such an issue? The whooshing and pounding the ears thing and associated symptoms?\n\n- Does this sound like a postural issue?\n\n- If so, can you recommend great yoga poses for combating this? What are the best stretches for neck, shoulder and upper back tension? I don't get pain as such, but lots of tension and pressure feeling.\n\nBtw, I'm an in-shape (and otherwise healthy) 34 year old man."
  },
  {
    "selftext": "       There are massive advantages technology brings to your Yoga training, teaching and business development. And no yoga teacher can afford to not know this. \n       The dynamic use of technology has benefited millions of people, be it trainers, business owners, teachers, and students in the past decade than ever before. You have to understand that now it isn't simply possible to achieve success as a Yoga teacher without using the internet, be it online or offline Yoga training. \n       That's why in this article, I've made an expansive list of the value technology has brought to Yoga and I've sorted them into two categories:\n\n1. Ease of teaching Yoga–\n       In the first category, Yoga teachers have benefited immensely from the convenience technology provides to perform, organise, deliver and interact smoothly. \n\nA. Advantage of Online Tracking Systems:\n       It's very easy nowadays to keep track of your students. You can track their progress, attendance and learnings. It can be a highly interactive platform and it gives valuable insights that can be used to teach better. Customer Relationship Management Systems can be integrated with Online Learning Platforms to provide practical application to improve their learning experience, improve customer and student relationship and possibilities of customer retention.\n\nB. Develop Content Creation Skills:\n       You can boost your creative skills by challenging yourself to creating content videos, blogs and articles, podcasts and vlogs. These modes have a tremendous impact on the internet community and the more you work on it the better you get at presenting yourself to your audience. It will also help you overcome your camera nervousness, develop writing skills, speech delivery and bring out a much required genuine character through your body expressions. \n\nC. Social Proof of Value:\n      The content you put up and the way in which you express yourself will help you to connect and make a deep impression on others' lives. You will be considered an expert at what you do. The reviews of your students and customers will be social proof of your expertise that no TTC certificate can get you. You can use their testimonials, reviews, and ratings, all of which will be showcased online. \nThis in turn will boost your credibility, by making you a reputable figure in your niche and it will attract the attention from the right category of people that you want. \n\nD. Sharing Value on Social Media:\n       Your online content keeps impacting the lives of those you want to attract. Many people interact and share information online more than they spend time sharing material things with each other. They share informative content related to yoga and spirituality with others to reinforce their status as spiritual seekers. This media circulation is an ever rising curve and it helps aspiring yoga teachers spread their value. \n\nE. Webinars and Live Sessions:\n       An important tool that benefits many online yoga businesses and teachers is Live Sessions and Webinars. You can use this tool to gather your target audience on a single platform where you can give them value and sell products. Live sessions also help you to take classes in the comfort of your home and teach a large batch of students without worrying about dividing them in different batches to teach one lesson like you would in a studio. \n\nF. Building a Community:\n       There are many online communities, viz. Facebook groups, pages, Instagram hashtags, Subreddits and so on, that connect people to a particular niche. It is easier to outsource the majority of your content and products to such communities. You can even add your prospective students and customers in your own social network easily nowadays. \n\nG. Direct Marketing to Target Sector:\n        Advertisement on social media makes you reach out to a specific set of audience who need exactly what you're offering. Artificial Intelligence and Machine Learning tools have advanced to such an extent that a mere thought or talk of leaning Yoga will show sponsored ads of your sponsored courses.\n \nH. Learning Management Systems (LMS):\n       Integration of digital web based tools for teaching Yoga courses are becoming a hot trend for upcoming online Yoga businesses. One of the most attractive tools are Learning Management Systems that are used to teach online. They can be automated and customised to run efficiently and it requires no physical effort. If you're a yoga teacher who's hiking in a forest, you could be simultaneously running your class smoothly without even having to worry about paying any attention to the class. Such full proof systems are making it a reality to live and earn on the go. \n\nI. Customer Relationship Management (CRM):\n       Then there are Chatbots and Automated Email Delivery options that provide automatic subscriptions, customer data, prepare contact lists and stay connected to your audience by sharing newsletters, updates and offers. \n\nJ. Survey Tools:\n       Survey tools gather data by circulating survey forms, analyze data, create graphs and present the results and inferences. They are widely applicable today to take feedback, gather accurate information, plan out options, take decisions based on data and compare results. \n\nK. Agile Development Systems:\n       Agile Development Systems can be used to define and refine your products and brand identity. They help in shaping up customer requirements and evolve solutions based on a collaborative approach between you and your customers. This is an effective way to scale up your products and generate Multiple Streams of Income depending on the market's specific requirements. \n\n2. Ease of learning Yoga–\n       In this category, I'll be shedding some light on how incorporating technology into Yoga training can be a sophisticated learning involvement for your students and customers.\nThe ease of access through smartphones has made it possible for the window to knowledge fit inside their pockets.\n\nA. Learning from Online Courses and Content:\n       Your customers and students, who are interested in using products from your specific niche, easily obtain your content, lessons, details and advertisements through optimized search engines, globally. They can interact with you at any given time of the day. Also, if they buy any of your online lessons and don't need to learn what they already know, they can sift through the content to what they require without spending much time. They also have the liberty of watching the videos multiple times to help them remember well, when all this isn't possible in classroom and studio sessions. \n\nB. Developing a Faithful Following:\n       It has never been so easy to give out value to customers and students. You can easily give them digital gifts and bonuses, that will generate an emotionally rewarding experience and inspire further participation in your business.\n\nC. Smartphone Apps:\n       Your customers and students can also develop daily mindful awareness about their Yoga practice by using smartphone apps that set reminders, organise tasks, listen to guided meditations and podcasts, etc. \n\n       So if you're planning to integrate all these tools into your lifestyle to become a tech-yogi, life can't get any more effortless and resources will start to flow. \n       After reaching here, you may have realised how essential it is for a Yoga Teacher to become adept and proficient at using technology. But you may be wondering how to get there. That's why I'll be answering this question in my next video. Please stay tuned. \n       If you found this article useful, please like and share it. Also, do share it with the ones who need to read this. Your questions and comments are most welcome below."
  },
  {
    "selftext": "Hi, all! I practice yoga about 3-5 times a week and have been for the last couple years. My flexibility and strength has definitely increased and my hip flexors have gained more flexibility as well, but for the past few months or so I have been experiencing what appears to be \"snapping hip syndrome\" which doesn't seem uncommon, but both hips snap pretty loudly now and it is getting to a point where I am experiencing pain in both hips from just walking/sitting/sleeping etc. I never used to feel pain when my hips snapped, but now it's pretty evident and a little concerning. I also figured that with regular yoga that it would help this condition and not worsen it. There have also been moments during certain postures or other activities where my hips \"lock up\" in pain, so I have to take it easy or stop...I can live in pigeon pose, but a yogi squat kills!\n\nDoes anyone have any experience or insight on this? Are there other exercises you would recommend, and if it's turning in to regular pain and discomfort, should I see a PT or is that unnecessary? Appreciate the time and insight, thanks!"
  },
  {
    "selftext": "Hey guys, came here specifically cuz I can't figure out what I'm doing wrong.\n\nWhenever I do a standing balance pose where I have to lean forward (ex. warrior III, standing split) I get an intense painful cramp in the outer hip of my grounding leg which causes me to lose my balance/fall out of the pose etc. It's almost instant all of the time whenever I try these poses. It doesn't matter if they are closer to the beginning or end of my practice or whether I have stretched them out yet or used them at all or not.\n\nEither way I would like this to stop happening so I can progress in these poses.\n\nAlso in other balance poses (dancers, eagle, extended tree) the outside of my grounding ankle burns, is that normal? I can usually breathe through it but it is rather painful.\n\nThanks!"
  },
  {
    "selftext": "I went to my first yoga class about 2 1/2 weeks ago and it was the most wonderful experience. Given I am currently going through a pretty nasty depressive episode, it made me feel really tuned in to my emotions and feelings. The mindfulness aspect was what really sold me and I really believe that coupled with therapy, yoga could provide me with some great benefits. How has yoga made you become more mindful or better to yourself? I’m interested in knowing if anyone started in the same boat as me."
  },
  {
    "selftext": "I’m gonna reel back in that wild title with some information: my girlfriend has CP and her legs are basically messed up. She lacks the physical balance to lift things with her legs and can barely balance on her right foot for 1 leg. I want to start a balance routine with her so we can try to work towards large goals like balancing for a minute. I am also aware that yoga is not like straight up just balancing, but I have no idea what subreddit could help. \n\nTLDR: How do I help my girlfriend become a balance master? Is it just as simple as just... doing balance positions?"
  },
  {
    "selftext": "Yoga is all pushing strength with not a lot of opportunity to develop pulling strength. With that in mind I bought a pull up bar to hang on my doorframe. So far I've been using it for [passive hangs](http://www.idoportal.com/blog/hanging) which feels really nice on the spine, and to do Puppy pose with, to open up my chest and shoulders. How else could I use it? \n\nAlso, I know it's not strictly yoga, so apologies if this offends anyone. I don't personally see it as any different to using a wall or a chair, or any other prop."
  },
  {
    "selftext": "I’ve been getting serious about my practice in the past 2 months and I really struggle with arm balance asanas (crane, crow, etc.) because I just don’t have the upper arm strength yet for most of them. Other than trying to do them as far as possible, does anyone have any tips/exercises I can do to build strength for them?"
  },
  {
    "selftext": "Several years ago I had an absolutely off-the-charts bizarro experience during a vipassana retreat.  Since then, I’ve had the same experience innumerable times in the course of meditation and in yoga class.  I used to grapple with the “meaning” of it, but I’ve given up trying to explain it to myself and now just accept it as the way things are.\n\nHas anyone here had anything odd arise in the course of your practice?  If so, what happened?"
  },
  {
    "selftext": "Usually after 30 minutes of yoga, I become so relaxed and sleepy that is hard for me to be productive right after and get work done. Is this normal?\n\nI know its a stupid thing to complain about because I guess that's one of the goals to be relaxed. \n\nBut what do I do to combat this?"
  },
  {
    "selftext": "I was tired after 11 hours at work and was on the fence about going, but that was easily one of the best classes I've ever taken. (Also: I sat myself in a corner away from everyone else, and my head cold was pretty mild.)\n\nNormally, when yoga instructors talk about \"toxins leaving your body,\" I roll my eyes. Now this was just a coincidence, but as I was in down dog, my sinuses momentarily cleared from the heat/humidity plus my head being upside down. Right then, the instructor went through the toxin spiel, and I was totally into it like. \"Yeah! Alright! Wringing out my toxins!!\"\n\nIt was a good flow sequence, to be sure, but I also think it was the hour of suspending disbelief that made it such a great experience."
  },
  {
    "selftext": "I’ve started yoga again and really enjoy it. But for the last few weeks I’ve had a weird pain in my hand, just next to my first fingers bone in the middle of my hand (sorry it’s hard to explain the location). When I put pressure on it, it almost feels like it needs to pop? I’m not sure, but if anyone has insight on that I would appreciate it. It is a little frustrating."
  },
  {
    "selftext": "I (22f) think that I’ve had right hip flexors for years but I’m just now realizing it. \n\nWhen I was in middle and high school I ran cross country. My hips/pelvic area hurt when I would run. When i would lay down to do sit ups in gym class, my back would arch a lot and hurt. When I do child’s pose my hips hurt in the same place as when I run. When I do shavasana, my lower back arches a lot and my lower back can’t really get comfortable. I also have a bit of weird posture. \n\nWhat are some stretches I can do to help with this??"
  },
  {
    "selftext": "I've decided to try yoga to help me with a number of chronic issues I've noticed over the last couple of years and hopefully be able to alleviate them a bit. I've done enough fumbling over the years with yoga to know a few poses by now and the general approach, but I think it's time to get consistent and truly learn the basics. I'm not looking for medical advice, I've been to a physical therapist/specialist who tells me that many of my issues(tinnitus, visual migraines, memory loss, brain fog, poor sleep, and so on) are caused by tension on the vertebrae in my neck and upper back, which honestly makes a lot of sense to me. The exercises I have from the specialist are very gentle relaxation exercises/habits, encouraging the muscles to relax, whereas before, especially during yoga, I would stretch, twist and crack, thinking that was a good thing. So I wanted to continue this theory of practice and I know yoga can be great for encouraging relaxation, and a few gentle and safe stretches to help move into more advanced stuff comfortably later, would definitely not be unwelcome.\n\nDoes anyone know of any online, preferably short(30 minutes or less) routines that have that particular focus? Could be the same one or few routine(s), in fact, I'd rather have a daily ritual that I can gradually get better at than constantly having to switch things up. Hatha yoga would be the obvious go-to, but I'd also add I find breathwork(the relaxation exercises I'm doing has the breath at its center) and chakra stuff very intriguing, so some pointers on pranayama, either exercises or learning resources, would be great.\n\nThanks in advance."
  },
  {
    "selftext": "I know, I know, just check the FAQs, I already did. \n\nIn my search thus far, I see a lot of videos and suggestions for the types of yoga that really seem to focus on the lower body. That's all well and good, but I have bad flexibility in my upper body as well. The class I used to go to works on lower body for the most part as well.\n\nAny suggestions on videos that practice stretching upper and lower body?"
  },
  {
    "selftext": "I've been doing yoga for a few years now, and there is definitely something wierd or different going on in my lower spine. I don't really notice it anytime except when I'm laying in sulpine, and am doing any form of foward bend/spinal flection. There seems to be an spinal extrusion right in the center of the rounded part of my spine that extrudes further and presses painfully into the ground when I do the flection. \n\nSome poses that it's obvious are\nPavanamuktasana (Wind Relieving Pose) and happy baby.\nI first noticed I was different when the yoga instructor told us to \"curl into a ball, and roll back and forth, massaging your back.\" It is painful for me to do this as the extrusion gets pressed into the hard floor, while everyone else seemed to have no problems.\n\nAs far as I know it's been like that all my life. It's not really noticable anytime except when I do sulpine poses... I'm wondering if anyone knows what it is and if I should get it looked at"
  },
  {
    "selftext": "I'm looking into getting into yoga for its many health benefits, but also mostly to build discipline, something I lack severely. Unfortunately I live in a quite isolated part of the interior of Brazil and there are no yoga instructors around. I would be interested in self learning a style that can be done every morning to promote health and discipline. My preferences would be a more traditional style that also has breath work and some kind of curriculum that I could follow (as a morning routine to build disciple). Also something with more resources (books/manuals, blogs, videos). What style would you recommend."
  },
  {
    "selftext": "I did some yoga today after about five days of not being able to. I've been feeling really bummed about some career related stuff and haven't totally emotionally processed my situation. But today after vinyasa I felt a lot of physical pain around my heart and shoulder blades (no this was not a heart attack) when thinking about my problem. But a few hours later I feel a physical shift, like I've come closer to emotionally processing my situation. Woohoo!"
  },
  {
    "selftext": "I’m Ashtangi and plan to travel with only a backpack. So I decided to bring yoga towel instead of travel mat. I already have a yogitoes but it’s a bit bulky and heavy for backpack travelling. Could you recommend a suitable towel?"
  },
  {
    "selftext": "Hey from Denmark.(sry for bad gramma) I been having some neck tensions. Been stretched out and recovered. But want to improve.\n\nwith Sirsasana/Headstand.\n\nsearching for tips and safeties. beginner level. \n\nI like headstand. It feels so great in releasing of tensions.  And i makes sense to me with gravity and all. But i worry for my neck or other injury's related. \n\nNamasta  yoga people"
  },
  {
    "selftext": "Hi, I tore my right medial meniscus 6 weeks ago. I stopped yoga to recuperate mentally/emotionally from this injury but have returned to the practice at a much lower intensity despite not having resolved the injury. Should I do postures on the healthy side that I can no longer do on the other side? Or should I stick to only doing postures that are accessible on both sides? Why/why not?\n\nI have accepted that my right quad will begin to atrophy, although I can still do some work to maintain hamstring/glute strength. The typical ways we might strengthen the left quad in yoga (various warrior/lunge postures) are not accessible because they place the right knee in a vulnerable position. However, bodyweight exercises like one legged pistol squat are still doable for left leg. Is there any reason not to continue to strengthen this other leg other?"
  },
  {
    "selftext": "First off, I follow all my yoga/fitness instructors on instagram. I dont care for the whole instagram yoga scene, but its a helpful platform to keep me up to date with class times/ knowing if the teacher will be away so perhaps I can try a new class that week. I lived in a smaller city and I became good friends with one of the teachers and she gave me leaving gifts when I moved, I went to her for years and don't remotely find this odd bc of the basis of our friendship and also he professionalism.\n\nI moved to a very big city, found my classes and have been going to them around year now. One class I really liked bc the teacher was very hands on and always pushing me deeper or teaching me the next progressional pose. After a year, he started DMing me after class to say how good my practice was, I didnt think much bc I was injured and thought he was just being encouraging. However this has progressed to him liking and commenting on all my photos (normally with that heart eye emoji) and stories and has said im beautiful. (I have not replied to any of these)\n\nedit- i also want to add he's just said some bizzare things in my DMs about his ex wife and stuff. I have never had a conversation with him in the studio that was more than a hello or letting him now about an injury\n\nIve been away on holiday, but now I don't want to go to his class. I dont even know if I should say anything to someone at the studio as this has taken place outside the studio. But Im generally just really annoyed and what I thought was a safe space, and now i can't go. It makes me think back on all the adjustments and times this man has touched me, and I was in a class today (diff instructor) and I really didn't like the adjustments or general closeness. \n\nI feel like it has ruined it a bit for me, because I love hands on teachers. Am I over reacting? Should I say something to the studio. I can't tell. How would you feel about it?"
  },
  {
    "selftext": "I have an old rubber mat that is beginning to disintegrate (flakes of rubber falling off constantly) and I am looking for a new mat.\n\nBut there are so many options out there these days, I am confused as to which one is the best.\n\nIdeally, it would not absorb sweat, so I wouldn't have to clean it so thoroughly before putting it away.\n\nThanks!"
  },
  {
    "selftext": "I'm just curious. I've seen several people use the underside of the mat (with the little circles). Is that side grippier or something? Mine is still fairly new so I'm working through some slippery practices."
  },
  {
    "selftext": "Hi all! \nStarting tomorrow I have a 2 hour gap in my school/work day in a city where I don’t live so I can’t go home. I figured I’d take yoga classes to fill this time but mainly to give me a place to physically be. \nI’m going to be alone and I have never taken a class before. I bought a yoga mat/carrier today and have found a place with great reviews but the class is for all levels and I’m nervous I’ll be the only complete newbie. \nI’m inflexible, a tiny bit over weight and I’m anti social. Im super nervous. Please any tips on class etiquette, what to bring and of course tips on how to generally not embarrass the sh*t out of myself would be greatly appreciated. Also, is it okay if I just sit there during a certain position instead of trying it? I feel like I might not be able to keep up and I’m wondering if in classes it’s standard for somebody to take a break for a minute on their own time. Thank you!"
  },
  {
    "selftext": "I want to find a good video or series of videos to help with flexibility. I am definitely a beginner, and my flexibility is quite frankly horrendous. My shoulders are super tight and I can barely touch my toes. I’d really like to get something that is less about strength because I already lift, run, and train BJJ."
  },
  {
    "selftext": "Is wheel pose beginner? Intermediate? Advanced?"
  },
  {
    "selftext": "Hi I’m new to yoga! (6mo) \nAnd I practice Ashtanga 5-6 times a week.\nThis summer was hot so I realized I sweat a lot during practice. And many ashtangi recommends a rug instead of a towel. And actually no one in my studio using a rug so I need some help to get the right one! \n\nWill it worth it in fall/winter seasons? \nCan I use it without a mat? \nLastly Rug recommendation please! (I’m thinking about getting huggermugger one, but it seems slippery issues. Does anyone have used this one?)"
  },
  {
    "selftext": "Ever since I start my teacher training course, I just keep looking up yoga pants &amp; tanks top non-stop, anyone can relate?"
  },
  {
    "selftext": "Hello yogis or not.\nCould you please recomend me a good book to keep studying this gentle art?\nI have finished Asana pranayama mudra bandha- Swami Satyananda Saraswati.\n2 years of constant training now. Dont care about the price or school.\nThanks"
  },
  {
    "selftext": "Hi everyone! First time I have posted in a while, just looking to see if anyone has experienced something similar/any teachers can offer advice.  \nI had been attending a weekly led ashtanga class for a year up until about 6 months ago when my work committments changed and I couldn't make it to the class anymore. From there I tried to keep up my home practice as well as possible and attended whatever workshops at the weekend that I could. I have started trying to get back into the ashtanga swing of things (easing into it as its a big practice for me) and have started doing the primary series led, up to navasana which is as far as I am comfortable with practicing at home. Jump throughs/backs are my biggest challenge so I am trying to step slowly and mindfully rather than jumping, until I can build up the strength to jump in a more controlled way. Recently I have noticed (which I did get to some extent when I attended class, but its worse now I'm practicing on my own) that the day after ashtanga, the only muscle pain I get is in my neck and feels like whiplash, its quite agonizing and takes several days to ease off again. Has anyone ever experienced this before with an ashtanga practice? Any ideas what I am doing wrong to cause it? The way I see it, ashtanga isn't a very \"neck intensive\" sequence so I didn't think I was working it this hard... is there drishtis that I should focus on to prevent this? I do like the practice once I get into the habit of doing it, but obviously consistent pain like that can be off-putting, and tbh I'm sure its something I'm doing. Have some videos of some of my practices if anyone thinks this would help. \n\nTL/DR: ashtanga yoga home practice causing whiplash pains - is there anything that I can focus on to prevent this?"
  },
  {
    "selftext": "Hello r/yoga,\n\nI'm writing this message to see if anyone has any experience in yoga therapy training. I'm currently in a teacher training program. This is not a yoga alliance approved, but a course that does deep into the science of Yogah, looking at the different paths and the 8 Limbs of yoga.\n\nI got into yoga because I was severely depressed and anxious, and no therapy, meds, groups, hospitalization was working. my mom suggested I try Yoga with this woman from India and while I was skeptical at first, it's literally transformed my life. I still have anxiety and depression but i manage it so much better because of following the teachings and practices in Yogah.\n\nI'm currently a high school maths teacher, and as I said I'm doing the yoga teacher training. I have an interest in eventually doing yoga group classes for those struggling with mental health. I know there are yoga therapy courses, but they are often attached to schools that are Asana focused, which I usually avoid. Was wondering if anyone has any background or experience with these programs or teaching yoga for mental health.\n\nThank you so much."
  },
  {
    "selftext": "Hello all,\n\nI made this video for my mom so she can loosen her hips and hamstrings.  It's a short flow incorporating some yoga poses and general stretching that can benefit anybody - especially runners.  Enjoy!\n\n [https://www.youtube.com/watch?v=W4y5Y6czJ\\_Y&amp;t=2s](https://www.youtube.com/watch?v=W4y5Y6czJ_Y&amp;t=2s)"
  },
  {
    "selftext": "Then life changed. Whatever. But lately I’ve been doing inversions every so often like headstand. Against a wall. Well yesterday I did it on the middle of my deck, not scared and prepared to fall. Well I fell! But I had no fear, my body was limber, and I feel fine today. I’m proud of myself and see the spiritual growth here and am so grateful"
  },
  {
    "selftext": "I've currently got an injured wrist and any weight on it really sucks. But i'm used to doing sun salutations every morning to prepare for the day ahead. I would like a short (10-20 min) routine to do in the morning and/or night just to keep up my daily practice. \n\nMy go-to youtube yogis are YogaWithAdriene and FightmasterYoga if that helps?"
  },
  {
    "selftext": "I've been practicing on and off for a while, but I recently started going to classes more frequently and I'm AMAZED by how good forward fold feels each time. Like DAMN feels like my whole back is being decompressed. I often feel like just hanging out there for a while, which I often do when I'm playing around at home. \n\nI pose this question to y'all-are there any similar poses I should look up that may create a similar release? I mainly practice vinyasa, and tend to go to one or two instructors, so I'm sure I only know a tiny percentage of what is out there. \n\nThanks!"
  },
  {
    "selftext": "Hello everyone!\n\nI’m not exactly sure how I got here, but I’m here. I’m just a 28 year old dude in Tennessee who’s never stretched a day in his life. I’m one of those guys whose lives with Crohn’s disease the last ten years and yet still has managed to be a tubster. \n\nMy wife is the exercise freak in the relationship and has done yoga on and off for years. One afternoon I decided on a whim to accept her invitation and do one of Yoga with Adriene’s videos, and holy shit! I actually somewhat enjoyed it. \n\nI’m thinking it’ll be good due to the low impact nature of it, as well as help me de stress from my hospital job. Next week I’m going to start one of the beginning videos and work at it. Just wanted y’all to know I’ll be lurking around!"
  },
  {
    "selftext": "My sisters and I logged on from 3 different cities, in 2 different states and did yoga together. We all synced up the same YouTube video and followed along while we video called with each other. It was a pretty great evening. Namaste"
  },
  {
    "selftext": "Hello all,\n\nI'm currently trying to dive deeper into the 8 Limbs and other traditional aspects of Yogah. I'm devoting myself to my work (karma Yogah) and still trying to do the other things. I'm not finding time for Asana, meditating, or pranayamah practice. I just want to do a little each day but I'm exhausted. Any tips?"
  },
  {
    "selftext": "Hey guys,\n\nI’ve recently started to get into restorative yoga and reading the Bhagavadgita and other religious and spiritual texts. I’ve also experimented rather heavily with psychedelics and am currently in recovery from substance addiction. \n\nWhile you might think I’m deluded or fried due to heavy psychedelic use, I think I’ve gained a decent understanding of consciousness. However, I need a more formal method of practice and am particularly interested in Kundalini yoga and mantra meditation. I’ve tried looking at various resources and frankly it just seems very esoteric and I have no idea how to penetrate the superficiality of the poses and get into the actual system of Vedic yoga. \n\nTherefore, I’m seeking instructions on how to get started on this journey. In particular,\n\n1) What books should I read?\n2) What apps should I use? \n3) Any yoga routines you’d like to share?\n4) Good YouTube channels? \n\nI would absolutely love to have mentors or people I can reach out to and check in with. I appreciate all your help with this. Thanks and good luck!"
  },
  {
    "selftext": "Hi there! I have super bad knees and all around a lot of muscle and joint issues and find that most workouts really hurt my knees and I feel very sore afterwards. I’ve always loved yoga but I really want to lose around 10-20lbs and I was wondering if it’s possible to do with yoga alone. Should I combine other workouts with yoga or could just yoga help me lose the weight? If so do you have any tips or tricks or online resources/instructors that could help me on my weight loss journey?"
  },
  {
    "selftext": "Coming from a Vinyasa perspective it has been interesting analyzing the the two sides of my body.  I've noticed that:\n\n-My upper left side is more flexible than my upper right side\n\n-My lower left side is less flexible than my lower right side\n\n-My balance and lower body strength are about the same on both feet\n\nMost interesting however is when I kick up for a handstand, when I lead with my right foot I feel like it's very controlled and there's a lot of thought behind the movement.  When I lead with my left foot however I don't seem to have any mental control over it and my body just kind of gets up there on its own.  With the latter it feels so confusing that I break the handstand because I don't feel like I have any control over my body.\n\nFor reference, I'm one of those weird people that writes with their right hand and bats with their left.  I'm also highly analytical from a mindset perspective."
  },
  {
    "selftext": "Hey guys, I’m new to this. I’ve always stretched after my lifting routine or rock climbing, but I want to get into yoga as well. It seems like a lot of yoga positions are similar to static stretching movements. Can I replace stretching entirely with just yoga? I feel like keeping all four programs would be pretty taxing on my body. Thanks in advance :)"
  },
  {
    "selftext": "I can only speak for US citizens, but we are in a mental health crisis right now, and unfortunately a lot of the people who need yoga and meditation do not have the financial ability to attend classes, so only people within a certain income bracket can sign up.\n\nI know I am not the first person to think of this, but I have never heard this discussed.  So why isn’t it?  And How can we as a community come together to accomplish it?   \n\nI know the first reaction might be in regards to a pushback from pharmaceutical companies wanting to monopolize the mental health industry, but with all the science that is coming out about the benefits of meditation and yoga, it’s only a matter of time before the facts and demand will outweigh the influence of big business.\n\nI also believe that it might be advantageous to the insurance companies in that it’s a lot cheaper to pay $100 a month for yoga as opposed to $350-400 for therapy, plus the cost of prescriptions.\n\nI think it would also allow for studios to flourish, teachers to be in demand, and hopefully create a more sustainable career path for people who want to teach. \n\nWhat are your thoughts? Good idea? Not realistic?  Can it be done?"
  },
  {
    "selftext": "For me, it was really learning about the power of the breath and associated bandhas, how to engage them to contain my prana and control it in even more refined ways. What about you?"
  },
  {
    "selftext": "I am getting back into yoga after some time off and I'm experiencing some back pain.  Specifically I get what feels like a Charley horse but in my back.  It sometimes happens after really back intense poses, like coming down from a plow pose, but then sometimes it happens from what seems like nothing.  Like tonight I was doing a restorative practice and I *slowly* went into a reclined cobblers pose, and my back cramped to the point I had to put pillows under my hips and roll onto my side.  What could I be doing wrong?"
  },
  {
    "selftext": "What are some tips for keeping your routine while bike touring and sleeping in a tent for long periods of time? My tent is pretty small and even if I carried a mat there would often not be a smooth place to put it. But I am curious what others have found to work as maybe I can adapt something. My budget does not include going to studios along the way."
  },
  {
    "selftext": "Do you feel like you get a different experience from doing yoga in the evening vs in the morning? Im curious if some of you do a combination of both or if it really just depends on your schedule. What is your preference and why?"
  },
  {
    "selftext": "I’m doing 30 days of Yoga right now - with Yoga with Adrienne on YouTube - working on listening to my body and today is day 10. I’m feeling really good. I’ve tried this before when my main focus was weight loss, and yoga was never a quick enough avenue for me. But now that I’m over all that and fully accept and love my body I’m doing it with the intention of listening to my body more and becoming more flexible. It’s been really nice and peaceful taking that time for myself everyday even through the sometimes challenging parts. I’ve definitely noticed small improved flexibility and a calmer mind so I’m going to keep going. I’m really excited to practice more and go take some yoga classes as well!"
  },
  {
    "selftext": "Hello everyone!\n\nI am an 18 years old male who wants to get into all of this stuff about yoga. Not just yoga actually, exercising, meditation, anything to improve myself.\n\nI remember reading somewhere about how yoga can boost your testosterone, to be more exact asanas poses(I hope they are called like that). I am not the manliest guy, can't grow a beard, can't put any weight. Stuff like that and I heard my doctor saying that I may need a T boost. Like having an injection with testosterone or something like that. Whatever. My question is: Can yoga boost testosterone? I will do yoga regardless the answer but I am just curious. I want to know the opinion of more experienced people in this domain."
  },
  {
    "selftext": "What do you think about this short warrior 1 flow?\n\nW1 with palms together infront of the heart - exhalation going into a forward fold til belly nearly reaches the tigh -  inhalation arms sideway out - exhalation arms down without touching the floor - inh. arms out like before.. and so on til back to standing and warrior 1.\n\nI'd like to do it within a \"gentle\" class, for strengthening the back. Is it much risk for the spine or would you say it's okay? \n\nThank you for your thoughts!"
  },
  {
    "selftext": "I had to tell someone! All of you have motivated me, made me laugh, and taught me about yoga. I know my husband is good for a while not to hear me talk about it ��\n\n have been going to a yoga studio and randomly going through flows at home since January of this year. I never expected to love yoga this much. Everytime I get on my mat and focus on breath with movement, I feel like a new person! I never understood how much strength goes into some postures. It amazes me how strong I am now. I still can't do any of the fancy postures...even though I held crow for 10 seconds the other day!! :) \n\nIf you are just starting out, keep with it and be kind and patient with your body. It truly can do wonderful things :)"
  },
  {
    "selftext": "I'm just chilling out in mountians pose and Everytime I would exhale my whole back would light up. It would feel like a wave of energy flowing down from the back of my head. Similar to getting a cold shiver. Concerning? Or did I experience something normal and amazing and not know how to interpret it?"
  },
  {
    "selftext": "I’m almost wrapped up my 200hr YTT and have received the opportunity to become an assisting teacher once a week at my local studio. For clarification, I’m not leading this class, just assisting students. I am teaching other classes tho. \n\nAnyway,  I want to know what your favorite hands on assists are. Which assists make you feel amazing? Are there any that you feel uncomfortable with? All experiences and opinions are welcome. \n\nOf course I’m looking at safety of the pose first. So checking for proper alignment and then diving a little deeper into the pose if the student wants to."
  },
  {
    "selftext": "Hey guys! So about a year ago I was doing yoga every day, eating healthy and working out. Then I moved and then got married. Now it's been almost a year without yoga... I was beginning to get SOOO flexible!\nI need some tips on some easy beginner poses and maybe some advice. \nI also LOVE doing yoga outside but where I live now is all dirt outside ��\nThank y'all!"
  },
  {
    "selftext": "A friend of mine just did this on the 5th try. Is that common? ��"
  },
  {
    "selftext": "Seems like most old yogic texts encourage breathing that is: gentle, shallow, slow etc. similar to the more modern breathing practice r/buteyko - ([video](https://www.youtube.com/watch?v=wgwxn9mRpAY&amp;t=519s))\n\n  Lao Tzu (circa 400BC)\n\n&gt;   A Perfect Man Breathes As If He Is Not Breathing\n\nThe Yoga Sutra of Patanjali (4th-2nd century BC) \n\n&gt; Pranayama [the main breathing exercise in yoga] is the cessation of\n&gt; inspiratory and expiratory movements.\n\nThe Gheranda Samhita (15-17 century)\n\n&gt; (7) Whenever the yogi may be, he should always, in everything he does,\n&gt; be sure to keep the tongue upwards and constantly hold the breath.\n&gt; This is Nabhomudra, the destroyer of diseases for yogis. \"\n\n\nThe Shiva Samhita (17-18 century)\n\n&gt; (23) Again, let him draw breath through the right nostril, and stop breathing as long as his strength permits; then let him expel the air\n&gt; through the left nostril, not forcibly, but slowly and gently.\n&gt; \n&gt; (39) When the Yogi can, of his will, regulate the air and stop the breath (whenever and how long) he likes, then certainly he gets\n&gt; success in kumbhaka, and from the success in kumbhaka only, what\n&gt; things cannot the Yogi commend here?\n&gt; \n&gt; (43) ... from the perfection of pranayama, follows decrease of sleep, excrements, and urine.\n\n---\n\n\n\n\n\nKapalbhati is first mentioned in Gheranda Samhita which was written around 1700 C.E so 300 years old or so. \n\nhttp://www.ghoshyoga.org/blog/roots-of-ghosh-yoga-the-gheranda-samhita\n\n&gt;The Gheranda Samhita, written in around 1700 C.E., is the most encyclopedic of the hathayoga texts. It was likely composed in the Bengal region of India, the same region that houses Kolkata and Ghosh's College. This text was available in Bengali, a regional language spoken by ordinary people, as opposed to the sacred Sanskrit, so it had an outsized impact on yoga's development in the last few hundred years.\n\n&gt;...\n\n&gt;The last few chapters of the Gheranda Samhita cover topics that have largely been lost to modern western iterations of yoga. Admittedly, they are often difficult and require significant effort and persistence. In Ghosh's lineage, the practice of pranayama has been whittled down to Kapalbhati, with Sitali offered to some advanced students. Mudras and Pratyahara are more advanced still.\n\nhttps://www.yogapoint.com/info/kapalbhati.htm\n\n\n&gt; REFERENCES IN THE ANCIENT TEXTS\n\n&gt; Gherandsamhita describes Kapalbhati in its first chapter. Gherandsamhitakar state while describing the three types of Kapalbhati :\n&gt; \n&gt; G S 1.54\n&gt; \n&gt; \n&gt; There are three types of Kapalbhati - Vatkrama, Vyutkrama and Sheetkram. By performing kapalbhati doshas of kapha are eliminated.\n&gt; The next shloka describes Vatkram Kapalbhati.\n&gt; \n&gt; G S 1.55\n&gt; \n&gt; The air should be inhaled with Ida Nadi ( left nostril ) and exhaled through Pingala Nadi ( right nostril ). Again the process should be performed in a reverse manner.\n&gt; \n&gt; G S 1.56\n&gt; \n&gt; \n&gt; Pooraka and Rechaka should be performed rapidly, without performing Kumbhaka. This eliminates kapha doshas.\n&gt; \n&gt; Then Vyutkrama and Sheetkrama Kapalbhatis are described. However, we will see them under the chapter Neti.\n&gt; \n&gt; The process of Kapalbhati that we have studied so far is different from that stated in Gherandsamhita. Hathapradeepikakars have described Kapalbhati in a more correct manner.\n&gt; \n&gt; 2-35\n&gt; \n&gt; \n&gt; When Pooraka and Rechaka are performed rapidly as in bellows of a blacksmith. It is known as Kapalbhati. The study of Kapalbhati reduces kapha doshas.\n&gt; \n&gt; Both Gherandsamhita and Hathapradeepikakars agree that the practice of Kapalbhati eliminates kapha doshas. Hathapradeepikakar describes the process in detail. And the simile used by them is very apt in the sense that if one observes the movement of the bellows, the fan is pressed to release the air out with force and then loosened to let the air in with natural ease. Similarly, a forceful rechaka and natural pooraka with rapid movement is expected in Kapalbhati. Hence, the description by Hathapradeepikakar is more proper and clear than that given by Gherandsamhita and is more in vogue.\n&gt; \n\n---\n\nSo we know its at least 300 years old. but Do we know how old it really is ?\n\nBonus questions do you think that everyday breathing should be \n\n- gentle or forced?\n- silent or audible?\n- nose or mouth?\n- diaphragmatic or belly?\n- small or big?\n- slow or fast?\n- deep or shallow?"
  },
  {
    "selftext": "Morning all,\n\nI'm new to and loving yoga and have a pretty hectic schedule, kids, family, and shift work including nights, which means regular scheduled practice can be tricky. I've mostly been following Jess Timsit's 30 day yoga challenge and am really enjoying it, and I've managed a couple of IRL classes too.  I just wondered, what exercises or poses would you suggest I practice between sessions, for example at work in my office or at home watching TV, reading, etc. that will improve my work on the matt?\n\nTYIA"
  },
  {
    "selftext": "Hi, I've been interested in learning more about yoga/stretching for a while now. I got almost halfway through the 35? week sequence in Iyengar's Light on Yoga, but gave it up after reading The Science of Yoga and a few articles that suggested a lot of the poses don't really have any actual benefits and can cause harm. I want to know, where can I learn (mainly looking for books) more about yoga/stretching from an unbiased scientific/anatomical perspective? I don't care for the \"spiritual\" side of yoga, although I do enjoy the calming effect it has on my mind. Ultimately, I just want something that is going to help me stretch my muscles and improve my posture."
  },
  {
    "selftext": "Hi, I think a few months ago someone posted here a link to a website that aggregated dozens of podcasts on yoga (and related themes). I tried to search for it but with no luck. Anyone knows it? \n\nThanks"
  },
  {
    "selftext": "Hey guys,\n\nMy CT scan indicated herniated discs at L4-L5 causing moderate spinal stenosis and another one at L5-S1. This is causing symptoms like tingling sensation, pricking sensation and pain in my legs.\n\nPeople who've had this problem or suffering from one currently -\nI'm looking for recommendations on yoga poses that I can try to alleviate my condition.\n\nThanks in advance."
  },
  {
    "selftext": "Looking for some poses that will help my arm strength and toning.  I know downward dog is meant to help but looking for some different intermediate- beginner-ish poses. I’m definitely no yogi yet haha. \n\nYoga pose related advice only please ! I know that I need weight training and all the other ways to gain strength. However, I am only able to do yoga right now.\n\nThanks in advance !!"
  },
  {
    "selftext": "I want to teach underserved populations. I'm a 55 year old with a 4 year 4-5 day a week practice. There are no local studios that are a good fit for me, so I'm planning on traveling to attend 200 YTT. I will supplement this with shorter courses that get more specific. \n\nAny studios that you recommend or do not recommend? I'm looking at Asheville Yoga Center and Wilmington Yoga Center, but open to the world."
  },
  {
    "selftext": "I'm not intending to start an argument or pass judgement on the usage of the word. But I would just like to brainstorm other ways of ending classes that don't include saying \"namaste.\"\nOf course, both yoga enthusiasts and teachers are welcome to chime in!\n\n\nEdit: grammar"
  },
  {
    "selftext": "Some studios ask not to bring in cell phones and keys etc. So where am I supposed to put them if the studio doesn’t have lockers?"
  },
  {
    "selftext": "[ETA: I just noticed the image embedded. This is NOT an image of me, it’s of someone else in the sub. I’m really sorry to that person; I’m trying to get rid of it]\n\nThis sub has been more helpful to me than any of the instructors I've seen locally on correcting alignment and troubleshooting pain, so I'd love opinions.\n\nAfter about 8 months of exhaustive trial and error, I have corrected my downward dog and finally don't have any shoulder pain (ETA: I realize the delt is technically part of the shoulder. I was experiencing acute shoulder pain elsewhere before). My DD now resembles the second pic here (of another yogi redditor):\n\nhttps://imgur.com/zriFAK9\n\nHOWEVER. I cannot stop experiencing pain in my left deltoid -- pretty much the area between the bicep and tricep. It's ONLY the left one, and it's only when my practice includes downward dog. The pain is a dull, bothersome ache and is very tender to massage. Pain flares after doing a few DDs. An instructor said this was probably because I was engaging new muscle groups and it would go away in time. It's been about 3-4 months of 1-4x/weekly practice and continues to be a problem. The pain goes away within 2-3 days of no DD.\n\nMy left shoulder IS less mobile than my right, but not absurdly so.  Any ideas?"
  },
  {
    "selftext": "K so I’ve been practicing yoga off and on for 10 years or so, the last 3 more off than on. I’m working my way back to my practice, and am going through the growing pains of building up strength, endurance and flexibility again.\n\nI’m finding it incredibly challenging to do any lower body based asanas. A standing forward fold burns, and I cannot straighten my legs entirely. Seated forward fold always needs a bolster under my knees. Laying on my back with my legs up, whether one or both of them, using a strap, my leg(s) vibrate to the point I cannot hold them up, and once again I cannot straighten even with the extension of a strap.\n\nI don’t know how to approach this. Don’t push myself as hard? Is it my hams or quads causing the restriction? Is my core weak?  All of the above, and if so if I power through with a balanced practice and one day mm by mm I’ll get more comfortable?\n\nI know a part of this is striving, as I admire yogis who can seemingly just flatten there legs to the ground and fold over them, so I’m working on meeting myself where I am. \n\nHas anyone had similar experiences or advice on where to focus?"
  },
  {
    "selftext": "I am interested in what womens roles were in the practicing of yoga and how that has changed over the years. Does anyone know of have suggestions on where I could learn about this history?"
  },
  {
    "selftext": "That doesn’t have lumpy pads but also doesn’t show my nipples. For hot yoga and non-hot yoga. Does this exist? Every one I’ve tried (mostly target stuff) either has padding that slips around or folds up or shows my nipples when I take the padding out. ����‍♀️ I literally need no support."
  },
  {
    "selftext": "I'm new, sorry if I don't have the lingo down.  About 6 years ago I started doing Yoga in my living room, I had Dish network at the time and found a channel with a show called Yoga Sutra Now, hosted by Jia Sugrim, there was one specific episode called Bro Down specifically designed for guys.  At the time I had it on the DVR but I've since moved and fell out of the Yoga world.  Now I'm trying to get back in and have been searching for this episode or something similar.  I remember hamstring poses stretches that were really good but I can't remember how to do them.  I also tried contacting Jia on facebook but no response."
  },
  {
    "selftext": "I'm new to yoga, I find some movements embarrassing to do even when I'm alone! like rapid and loud breathing or some chanting.\nI find it really difficult to focus and get the most benefit of it..\nAlso I get all sorts of negative ideas about my body image while practicing.\n\nAnyone here got the same issue? Do you have any tips?"
  },
  {
    "selftext": "I’m unable to keep my legs straight when I forward fold or have my legs in the air.\n\nEdit to add: I know I have to stretch, I’m asking specific stretches."
  },
  {
    "selftext": "Was looking to do yoga on the regular for some toning  and to get my energy back. I procrastinate so much into not doing it because I’m not sure how really effective it will be for me unless I ask someone whose been in the same rut. I’ve always been on the bulkier side with my legs and hope to always tone them and get some energy back. I’d like to know anyone’s before/after story"
  },
  {
    "selftext": "I go to a chan Buddhism temple and it's not uncommon for people to sit for multiple hours- I know a monk sat for 13 days! What's the longest you've sat ? I can only do about 20 minutes"
  },
  {
    "selftext": "Been practising bunny hop handstand yesterday and it gave me numb fingers on the right hand.\n\nIt took a whole night to recover. But now I realised i can feel a slight discomfort (not painful enough to call it pain) at my wrist when I extend it to the 90 degree angle (handstand angle).\n\nDid I just strain my wrist? Is it safe to continue with handstand practice or pull-up movements?\n\nI will go easy on wrist heavy asanas this week. I’m currently taking teacher trainer daily, so it’s not possible to just totally stop and rest. Thank you !"
  },
  {
    "selftext": "I just had my first class in over a week. I had to be out of town for family stuff and I was missing being in the studio, but how my body feels now after class... WOW. I didn’t realize *how much* I missed it. I feel amazing! AND I was way more bendy tonight?"
  },
  {
    "selftext": "tldr; yoga is cray these days. How can we bring it back to the good 'ol days?\n\n&amp;#x200B;\n\nSometimes when I look at the world of yoga in the present day, it seems we've blown everything out of proportion and turned yoga into this crazy gimmick: goat yoga, yoga + beer, yoga with glo sticks, halloween costume yoga, etc. I understand it can be fun and it invites in the mainstream folk who may be turned off by the traditional aspects of the practice or who may be intimidated to try, but it seems like the heart of the practice has gotten lost somewhere. Studios can only stay alive it seems by offering all these workout-focused classes that are hot and fast with loud music, and majority of people like that! How can we get back to the beautiful simplicity of the teachings, while still (as studios and teachers) stay alive? Thoughts on this?"
  },
  {
    "selftext": "Hey all, I tried searching for this but could not quite find exactly what I am looking for/was overwhelmed by options I didn't know what would be best. I started yoga a few weeks ago and am enjoying it. Though I am still getting used to some of the poses.\n\nThe classes can flow quickly from one pose to the next. What I am looking for is a companion resource to common yoga poses. How to set it up, where I am supposed to weight bear, where I feel a stretch etc. So that I can look these things up after class.\n\nI found pocket yoga, though it does not go into much detail about the pose and just seems to list the pose itself? Ideally, a book or kindle book would be good."
  },
  {
    "selftext": "A girl from my city fell out from a 5th floor presumably while doing yoga in her balcony. She survived but has a lot of injuries and bone fractures. She is in the hospital with a serious condition. \nThere is a picture from her doing some kind of inversion while hanging from a glass balustrade.\n\nPlease do not risk your life just to get some likes in social media. That isn’t yoga.\n\n[News article.](https://www.eluniversal.com.mx/estados/cae-joven-de-quinto-piso-mientras-realizaba-yoga-libre-en-nuevo-leon) in spanish."
  },
  {
    "selftext": "Hi! \n\nI did a search but could not find anything specific for this. I recently started practicing yoga. At my shop, we have weightless yoga with the trapeze. I love it! Problem I am having is the material of my shorts get stuck with the fabric of the trapeze and makes inverting quite difficult. Girls at the shop told me to get biking shorts but I am not quite sure that is all I want to wear to class. I thought of Boho pants but unsure if the right material. It is not like \"male yoga pants\" is a hot market out there. Any recommendations from anyone that practice on a trapeze will be greatly appreciated!\n\nThank you!"
  },
  {
    "selftext": "Hi fellow yogis! I'm pretty new to the practice (started in December) but have fallen in love with yoga and now my body seems to crave it. I've mostly just done Yoga with Adriene, who made it super accessible to me as a total beginner. \n\nHowever, I recently hurt my lower back lifting up my toddler, and now I can't do a regular practice without causing myself terrible pain (forward folds are particularly difficult). I've been cycling through YWA's three videos on lower back pain, which are pretty good, but well, that gets old. My back is healing pretty slowly and the physical therapy my doctor recommended doing basically consists of yoga poses, such as cat-cows. I'd appreciate any additional suggestions."
  },
  {
    "selftext": "&amp;#x200B;\n\nhttps://i.redd.it/zjks4on85zi31.jpg"
  },
  {
    "selftext": "Question for fellow uterus-havers: do you practice when you have cramps/your period? \n\nI got my IUD replaced this morning, and currently have the expected cramps. I don’t typically get cramps during my cycle (I don’t get a period), so I’ve never practiced with them. I usually attend a Tuesday night vinyasa class - would it be Too Much to attempt the class tonight/should I attend a non-vinyasa class?"
  },
  {
    "selftext": "I’m a new yoga teacher. I’ve been studying at this particular studio for about 2 years, but have done yoga for about 15 years. Last year, my favorite teacher announced that she was moving, and recommended me for teacher training, and I said yes. I now teach 2 beginner level classes and am considered a teacher in training. \n\nNow that my favorite teacher has moved, I have been attending the studio owner’s classes and training under her. Let’s call her Stacey. \n\nI had attended Stacey’s classes before my favorite teacher moved, and while she wasn’t particularly friendly, she was knowledgeable and her classes were good. \n\nTraining under Stacey has been absolutely awful. She actually yells at me in class, in front of students, if I am doing the poses wrong. Sometimes she will ask me to assist her while she is teaching, and has yelled at me if I’m not assisting correctly to the point it makes me cry. She uses embarrassment to correct me, like if I have the wrong arm position, she will stand next to me and tap her foot and sigh until I figure out what I’m doing wrong. She has slapped me on the back once while making an “adjustment” and pushed me out of Vrksasana once during a teacher training exercise. \n\nIn the past year, she has had several teachers quit including my favorite teacher that moved, which makes me believe I’m not the only one that doesn’t like working with her. However, she does have one other teacher that has been with the studio long term, and I wonder how she does it? \n\nI reached out to my favorite teacher and told her what was going on, and she said “yeah she treated me that way too. She’s hard on you because she likes you.”\n\nI’m trying to figure out what to do. I have a day job that supports me financially. This was supposed to be for fun. It’s not fun. I actually like teaching yoga but find it a little overwhelming to do with my day job (45 hours per week). \n\nThis is my dilemma. I love the style of yoga I do, and there isn’t another studio nearby with this style. I like my yoga friends, and would miss them if I left. I am thinking of just trying out taking classes at other studios nearby to see how it is, and if I find a good match, then resign. The only thing is, it’s a small town and a lot of students at my studio attend at other studios too, so others would know if I’m trying out other studios. \n\nI have thought about sticking it out until I move in about 5 years, but I don’t know if my mental health can take it. I like teaching yoga but would prefer to be a student first. \n\nAlso, if anyone has advice on resigning as a yoga teacher, I would love to hear it. \n\nTl;dr my yoga boss is a bully, but I like this style of yoga and miss my favorite teacher. I would also love advice on how to resign as a yoga teacher."
  },
  {
    "selftext": "I've been meaning to try out some streaming yoga options and this popped up and I thought I'd give it a try.  Done a few of the classes and they are solid and site works well.  If anyone is interested.\n\n[https://www.groupon.com/deals/theyogacollective-com](https://www.groupon.com/deals/theyogacollective-com)\n\nThis isn't a referral link or anything.  I just wanted to share."
  },
  {
    "selftext": "Has any of you experienced problems with numb muscles or compressed nerves after practicing yoga? It's been two or three weeks that a small part of my left calf went a bit numb. I put my foot behind my head during my yoga practice and I think that I put too much pressure on some nerves and then I stayed in this position for too long (30-60 seconds). I realized immediately after this that it somehow felt numb. It's only a small part of my calf, just the region that was touching the back of my head. I thought that with time it will be better, but it's the same. I have no problem walking, doing sports or anything, but when I touch the skin at this particular point of my calf, it just feels \"weird\". Has any of you had an experience like this? If so, how long did it take for the numbness to go away? Is there any treatment?"
  },
  {
    "selftext": "Hi guys, so i'm not sure if i'm in the right place, so please forgive me if this post isn't where it should be.\n\nI'm looking for some insight from the people here at r/yoga, maybe some advice and your own experiences with yoga.\n\nSo a little background about myself: i'm 28 and i have had crohn's disease for around 20 years. Also a sneaking suspicion of arthritis but never formally diagnosed. I used to box briefly, but the high cardio/high impact took a toll on my weight as well as my joints. I've been weight training on and off for the last 4 years, stopping every now and then due to flare ups, injuries etc. I always focus on my form but sometimes the body doesnt have the fuel or durability to keep up. I find myself in this position right now, hence the reflection.\n\nI have been to a couple of yoga classes a while back when it was free with my old gym and it left me feeling so calm for the rest of the night each time i went. I hear it can work on your core strength as well as strengthening joints. My goals are to commit to something new, the idea of reducing crohn's stress, building strength and being able to do it all from home seems great. I'd just like to hear your own experiences and views if you have the time. Of course i'd would be very eager to hear of anyone in a similar background to myself who has found success in yoga. \n\nOverall i'm just getting sick of the start/stop of strength training with my crohns. And although its not a strain on the body in the same way that high impact cardio is, i'm starting to feel like trying an alternative may be worth while, even if there's no guarantees i'll be able to sustain it any better.\n\nThanks for letting me rant, i appreciate any and all feedback"
  },
  {
    "selftext": "I'm considering getting certified to teach aerial yoga, but it's expensive and I don't want to waste money if this is just going to be a trend where the demand dies off after a few years of being a novelty. Do you think demand for aerial yoga is going to remain high for the long-term?"
  },
  {
    "selftext": "I’ve done my second heated vinyasa yoga class. I’ve been so sore that it’s kind of hard to function and cope. And I’ve done boxing everyday in the past and intense exercise so I’ve dealt with soreness before but this is a new level and it’s made me even feel sick in the stomach. I’ve made sure to drink a lot of water also.\n\nI want to get to a level where I can go 6 days a week but atm I’m sore for days. I want to persevere and stick with it, does it get better?"
  },
  {
    "selftext": "I’m at a loss today."
  },
  {
    "selftext": "If I am standing up straight or kneeling straight up my hips are both level with one another; however, if I sit back onto my feet into a kneeling position all of a sudden my right hip is very noticeably higher than my left.  No matter how I seem to adjust my hips or chest I can’t seem to get them aligned.  My lower right back always feels so much tighter than my left in day to day activities and the same goes for my right hip flexor.  Based on these descriptions is there anything I can do to mediate this issue? Thanks"
  },
  {
    "selftext": "Hello, today was my first time doing kemetic yoga (Which is slower and holding poses for a bit longer than usual)  and I moving from standing forward bend to stand, I felt dizzy/light headed. But it passed, is this normal? Should I be worried? Will it pass?"
  },
  {
    "selftext": "Hey everyone! I’m 29yo and have been practicing on and off for about a decade. My hips, hamstrings and groin are still super tight! I would love to be able to get into a wider straddle pose/ almost splits pose one day. Has anyone achieved this after 30? If so, any suggestions on how to get there, poses etc? Thank you!"
  },
  {
    "selftext": "I’m new to this sub so apologies if this is irrelevant, I just wanted to share with someone! I Had a great practice tonight where I pushed myself even when I doubted my ability and honestly just loving that post class deep breathing ability! Had a rough week and feeling my lungs stretch themselves with a few nice deep breaths before bed has been the exact relaxation I needed ☺️"
  },
  {
    "selftext": "Seriously considering enrolling in teacher certification classes. I live downtown Chicago - Anybody have any suggestions in courses/studios? Other option I am considering is traveling abroad this December when I have a 3-week break from work. Thoughts on this? \n\nAlso anyone here that work full-time AND teach only on the weekends? What’s that like? Where are you located and is it easy to find studios that’s accepting teachers with this type of schedule? \n\nThanks in advanced ♥️"
  },
  {
    "selftext": "Hi, I am a mid-20s female with significant problems with hypermobility, particularly in my hips and shoulders but also in other joints (was born with it, but made it worse with 18 years ballet training). Due to this hypermobility, I am not accustomed to having trouble accessing poses but the one that seems to have given me the most trouble over the years is seated wide angle posture. I am fine in seated forward fold and also in wide-leg forward fold (standing). However, when I move my legs into seated wide angle pose, I get an extremely intense sensation along the inner thighs even if my legs are at less than 90 degrees. Any ideas on what this could be a sign of? How to better release this tightness? One of my guesses is that it could be the inner thighs tightening to make up for the looseness of my hips... Any guidance or ideas welcome!"
  },
  {
    "selftext": "Can I solve���� inferility problems by practicing yoga?\ngive me your opinion,����"
  },
  {
    "selftext": "Just trying to get a feel of all the different methods out there :) Do you write it out before hand? Do you keep some parts the same and add in certain asanas that you feel will be helpful additions to the practice?  Do you just literally “go with the flow”?  Do you have a set series of poses like ashtanga?  Thank you in advance for any answers.  Additional question for RYT’s, does your method of a self guided practice differ from how you create a practice for a class?  Thanks again and Namaste!"
  },
  {
    "selftext": "Yoga has made me realize a lot about myself. Especially the things I dont like about myself, and then has helped me accept those things. I did not expect this. I guess I expected it to bring out only the good, but what I got instead was everything. Nothing has ever done that for me..  If this makes any sense , yoga is like the parents I have always wanted. What a gift."
  },
  {
    "selftext": "I'm my own worst critic. Aren't we all? Well, I'm especially hard on myself for some reason and yoga has been a great tool in helping my mental health. I am seeing a therapist but just wanted some advice from experienced yogis. \n\nI step on my mat not feeling good enough to be in the class or doing yoga. I worry in my head about how do to the poses and criticizing if I'm doing them right. Like chair pose for example, I cant keep both heels down on the ground and cant squat right into it. And that's where the self doubt starts. I understand others aren't looking at me but I cant help but feel like such a novice coming into a class where people can do so much and I'm like uncomfortable in chair pose. \n\nI dont know if this post is allowed or if this is the right sub. I guess just some positive mojo might help get me unstuck. I went to a yoga festival on Saturday and had such a good time outdoors meeting new people and doing yoga I want to bring that happiness into a class where I normally feel the opposite.\n\n\nThanks in advance ��✌��"
  },
  {
    "selftext": "I’ve been doing yoga for about three months, and fallen completely in love with it. It’s already been kind of an emotional and personal journey for me, and I really look at it as my personal safe space. \n\nToday I felt completely horrible during and after my practice. \nI decided to take a class even though I felt kind of tired in my body, but my head needed a break. \nThe practice itself was alright. \nBut the instructor was very.. ambitious? I don’t really know what word to use here. \nLook, I don’t do yoga to burn fat, get in shape or anything like that. I do it to feel good in my body. And I don’t have to typical “yoga body”. I’m short and kind of stocky/compact build. \n\nMy teachers first comment was when I did equestrian pose and didn’t have my palms completely in the mat. \n“Don’t be lazy now!”.. \nThat happened two times. And I actually caught myself forcing my palms down the mat and the pose felt completely wrong for my body. I did the pose several times, and every time I didn’t have the palms in the mat she said something like “don’t be lazy! You’re only fooling yourself, you’re not fooling me!” \nAnd I’m just here like... I’m not here to fool anybody, I’m here to do yoga and feel good. \nI suddenly felt that I had to prove myself for this teacher, and it actually affected me way, way more than first anticipated. Yoga always make me feel good about myself and my body, and this time I felt horrible. I felt fat and short and stiff and weak... \n\nIm gonna go tomorrow again, and fortunately it’s my favorite instructor doing the class.."
  },
  {
    "selftext": "I have a back arch and honestly looking to get rid of it. The arch makes me look fat and it's been bugging me. Sorry if this doesn't go here."
  },
  {
    "selftext": "Hi yogis,\n\nI took dance my entire life and they train you to always turn out from the hips. As you know, yoga is the opposite (square your hips!). I was wondering if anyone had any tips on specific muscles to engage to combat turnout, specifically in locust pose. \n\nAs soon as I start to rise into locust my hips automatically turn out and even when I'm focusing on lifting from my hamstrings, my glutes/inner thighs take over. What muscles should I focus on activating here so i'm doing the pose correctly? As a note, I'm also very hypermobile in my hips, shoulders, elbows, etc.\n\nThank you!"
  },
  {
    "selftext": "Looking for a yoga retreat from the window of Oct 7-Nov 2."
  },
  {
    "selftext": "I can do headstand just fine, but I have to \"hop\" into it. I've realized that the problem is that I can't walk my feet in far enough to completely stack my hips over my shoulders so my feet will just \"float\" off the ground. But I don't know if it's because my flexibility needs some work (I'm moderately flexible) or my body proportions are off (torso on the shorter side, with longer legs). I know I have the core strength to do it. Honestly it feels like my legs are too long or something. I figure if it really is my body proportions, then it likely won't ever be possible for me and I don't want to waste the effort. But if it's a simple fix, I'd love to hear some advice! Anybody else ever had this problem?"
  },
  {
    "selftext": "Hello r/yoga! I’m here on behalf of my partner trying to find some information.\n\nShe is an avid fan of yoga, doing classes most days, the instructor course and has built a very solid foundation of friends and healthy habits because of yoga. She is about to undergo a fairly routine surgery how ever her abdominal wall will be damaged during.\n\nThe doctors have mentioned she can only do yin yoga after one month recovery and it’s possible she won’t be able to perform things like headstands ever again. While I work in healthcare and find doctors words to be fairly final, I am wondering if anyone has any suggestions or past experiences with how she would be able to get back on the horse (or downward dog?) and continue with her favourite hobby.  \n\nThank you for any help you may be able to offer!"
  },
  {
    "selftext": "Stay as motionless as possible and begin to deliberately make the breathing slower and deeper. The aim is to use the entire capacity of the lungs but without any undue muscular effort or strain. The lungs may be held empty or full between exhalation and inhalation **to lengthen the cycle.** The important thing is that the mind should direct it’s complete attention to the breath cycle. When this can be done for thirty minutes, proceed to not-thinking."
  },
  {
    "selftext": "Hi does anyone know a yoga position for hip flexors? Mine are really tight to the point of it’s pulling on my hamstrings"
  },
  {
    "selftext": "This seems to be a theme today with my clients so I thought I'd take a moment to reflect on it. Yes, the goal of yoga is to quiet the mind but that is not only for stress relief. It's much bigger than than that. Yoga today is about feeling good, relaxing and finding some time for ourselves in this very hectic society and lifestyle we find ourselves in. However, that is not the reason we practice.\n\nIn the yoga practice we do many things to help improve our physical and mental well being. What we are really after is that sense of peace and freedom we have when we end the lesson in sivasana, or the corpse pose. That alone is to make us embrace our mortality which is already work enough. It is supposed to give us a sense of separation from the body. This is not your body nor is it your mind. They are vehicles alone. In the corpse pose we are supposed to realise this. Here we are supposed to be able to completely separate from the flesh and connect with the spirit.\n\nOnce we can embrace that concept then we can look further to see the True Self as something completely different than these bones, flesh and thoughts that we have. That's the person we are trying to connect with. That is our own little piece of God right inside of us.\n\nWhen we are able to make this connection, it is ever so brief. You get this overwhelming sense of calm. You realise nothing else matters and you are content and happy with things just as they are. That's what it feels like to be connected with your True Self.\n\nThe more you practice the easier it is to get into that space, to reconnect with who you truly are. The longer you are able to stay in this space the stronger the connection becomes  and the easier it is to return to it in the future. This is where we truly reside, hence the body being only a vehicle, and in this space we can learn to hear and feel what we really want and who we really are.\n\nWe feel lost or uncertain only because we have lost the connection to reality by outside stimuli and the senses. Before we become active members of society, and live as free spirits (children), we live through this awareness of who we truly are. Then everything on the outside is exciting, amazing and wonderful. Thats why kids are so nice to be around. They live in the present more than we can ever hope for as adults. Society, responsibility and over stimulation take us away from our true nature. In doing yoga all we wish to do is to bring ourselves back to that natural state that we have lost.\n\nIt sounds easy but its a quest that we will be on for the rest of our lives. Thats why its called a yoga practice."
  },
  {
    "selftext": "I seen a video a few years ago that helped fix my back and now I can't find a single video resembling the transition. The sequence started with an extended child's pose like [this video](https://www.youtube.com/watch?v=eqVMAPM00DM) where you use your fingertips to reach out and stretch your back with your head down, then it transitions into an upward facing dog or a cobra. Not sure which one it is but the transition occurred after you try to reach out with your hands as far as possible during the extended child's pose, to stretch your back. The transition to the upward dog or cobra keeps your nose at the same distance from the ground. It's like [this](https://www.youtube.com/watch?v=HerlEPvo5es) but the other way around starting from child's pose then to cobra, and keeping your nose to the ground as you move your head forward and into the cobra or upward dog."
  },
  {
    "selftext": "I'm looking in to starting yoga class in my local community college and am interested in Ashtanga in particular. There's a Yin class right after the Ashtanga one and I was thinking of applying for both. \nI've read that Yin is quite more relaxed in comparison to Ashtanga so i think it wouldn't be too taxing and would be great to wind down but I have no experience so I wouldn't really know.\n\nWhat do you think? Would it be OK to go straight from Ashtanga to Yin?\n\nEDIT: thanks for the input. I think I'll go ahead and book myself in to both."
  },
  {
    "selftext": "I’m wondering if there are yoga poses that will help me target:\n\n-Back fat \n-Love handles\n-Arms\n-Improve my ability to do the splits. I think my hamstrings are very tight. I can’t do a regular or open leg forward fold well. \n\nOr if you know any other specific exercises that will help! I have a wedding to go to in November and really want to tone up haha. \n\nThanks in advance!!"
  },
  {
    "selftext": "Does anyone here practice any martial arts? Which art? What style of yoga do you practice? Does yoga help you in any way in your art?"
  },
  {
    "selftext": "Just looking for your thoughts. I don’t mean something like food poisoning or a serious illness, but does going to a hot yoga class and “sweating it out” while you have a cold ever work for you?"
  },
  {
    "selftext": "I have been working on my jump throughs for Ashtanga yoga classes. I have very long legs for a woman, and also my hips are much broader than my shoulders. This makes it seem impossible to get enough clearance for both my legs and hips through the window created by my arms. I have to hold my arms farther than shoulder distance apart to make space for my hips, but that lowers my height so that I can't get my legs off the ground. \n\nAny tall ladies have success with jump throughs that can give me advice?"
  },
  {
    "selftext": "I know this is probably going to either get taken down or be pretty controversial, but I wanted to ask anyways.   Micro dosing is starting to gain some momentum as an alternative to traditional anti depressants,and I personally have experimented before practicing.\n\nI find that when I take a little more than a traditional micro dose I am much more aware of the pranic flow in my body and I am able to lift and move energetic blockages I may be experiencing.   I feel more meditative and afterwords my general well being is enhanced.\n\nI ask because I am curious what other people’s experience are like, if they recommend it or don’t and why.  And if there is anyone who has long term experience, I have only experimented twice a week for 4 weeks so I am by no means super knowledgeable.\n\nFor background I have had a daily seated meditation practice for close to 15 years and I’ve been practicing asana for 8, so although I don’t consider myself an authority in yoga and meditation I have enough experience to be able to notice the difference in experiences."
  },
  {
    "selftext": "I notice that during yoga class I feel good about myself if the teacher tells us good job, or that the poses look beautiful or if there is any kind of positive praise. Is that me going into the ego? Should I feel good about myself if someone tells me to? There seems to always be some kind of idea of doing good and I think I might be taking it too personally at times....The teacher also says, dont try to just get into the pose because that is the ego. We are practicing truthfulness, so she encourages us to be truthful with ourselves and what we can and cannot do. How do you really know what you can and cannot do? Dont we just do it and if we are okay with the outcome then that means it was right? If not, then that means we need to readjust? Maybe I am overthinking this. But I am not sure even how to be when in yoga class. How do you not be in an ego when you are in class or around others?"
  },
  {
    "selftext": "Hi all!\n\nMy girlfriend has expressed interest in learning more about Ayurveda. She is not the best at looking things up and gets overwhelmed so I am trying to find some information for her. She is a 200 hour yoga teacher and half way done her 500 hour. No degree. My questions are:\n\nCan you become a licensed ayurvedic professional?\nIf so can you do so without a medical degree?\n\nIf no to the previous can you legally and technically offer private ayurvedic or holistic health consultations as a private yoga teacher? \n\nWhat are some of the most reputable places to get certified or programs? \n\nThank you!!"
  },
  {
    "selftext": "I'm planning to go to a yoga retreat in March 2020 and looking for suggestions to somewhere with amazing nature and great activities. I live in Montreal, Canada so anywhere in Central America or Caribbeans or Latin America would be great. I'm a student so budget-friendly please, thank you! :)"
  },
  {
    "selftext": "I've been a yoga teacher for four years.  I love it and try to share that with my students.  Lately though, I've been feeling really uninspired.  And lacking in creativity.  Anyone else ever feel that way and what did you do to get over it?  I feel like I need some motivation."
  },
  {
    "selftext": "Just a random thought I had today. I just started doing yoga and I'm 4 days into the yoga with Adrienne 30 day challenge and already I'm wishing the videos were 40 minutes instead of 20. Yoga has been so comforting and has done a huge service to my mood, I always end.up being super happy during and afterwords, I'm wondering how this has been missing my whole life!"
  },
  {
    "selftext": "Looking for something that has many asanas but not like hundreds. To glance at during practice, while fitting in with vintage/Bohemian decor.\n\nEven a couple pages from an old book or something. \n\nI assume I'd get it on eBay or used book seller..."
  },
  {
    "selftext": "So I know there was a forum and one of the asked questions was doing some yoga with powerlifting, but I'm gonna try something different.\n\nI didn't want to go into lifting for the sake of bulking since I am already stiff from trying to simply hit the gym and working in my school's mailroom.\n\nSo I've decided I want to get into gaining flexibility and losing weight and gaining strength and endurance with Pilates and yoga combined. I also ride a longboard so it works me cardio wise. And due to a lack of funds, I will be doing all of this with YouTube or online apps that can provide an at home practice.\n\nHow can I go about combining the two together?\n\nOr even, how would I be able to set up my days where one is yoga and others is Pilates. Any suggestions for how I can go about this?"
  },
  {
    "selftext": "Hi all,\nI've been practicing all different types of yoga for about three years and finally decided to give Bikram Yoga a try. I was extremely let down and felt it was very dangerous, nothing like any of my previous yoga experiences. I had no idea about the controversy surrounding Bikram yoga until I searched if it was safe or even a \"real\" yoga form (loosely used, I'm not an elitist; it just felt so different than other yoga types). There was no flow, and you keep going from savasana to all these other poses which is extremely unnatural. I kept getting light headed and dizzy because there was no time for me to grab a drink (this may or may not be the instructor's timing, though). It was not focused on grounding you in the moment or appreciating and caring for your body. We were repeatedly told to lock our knees and force our knees down, and to push our body as far as we could, which I have never experienced before. It was 90 miserable minutes where I couldnt get my feet grounded or hold poses because of how wet I was. What are everyone's thoughts on Bikram Yoga?"
  },
  {
    "selftext": "As a yoga teacher I really don’t know how to act or to do.\nI have a couple of students, one of them has done yoga classes about 2 years with another teacher and now is doing with me. She doesn’t accept my suggestions and always says she wants to do by her own way and sometimes interrupts my class trying to correct the other one. So I talked to her more than once and said that was better if she tried to do by herself since she already “knows”, but then she said that she loves my class and has a lot to learn. \nI don’t wanna be rude, but kind of she’s irritating me."
  },
  {
    "selftext": "I've become addicted to vinyasa.\n\n I started doing it about three months ago and in the beginning I was doing it a few time a week for an 30-60 mins in conjunction with bodyweight strength workouts. \n\nThe more I kept with yoga, the better it made my body feel. Like I don't know why, but the slow burn of yoga is so much better than any high impact workout that I've done and now I find myself doing yoga every day and not wanting to do any other workout.\n\nFor some reason I feel bad, like this isn't doing enough to tone/build muscle.\n\nI just don't know how to go back to strength."
  },
  {
    "selftext": "I'm very new to yoga (\\~1 month or so). In my first class, the instructor led everyone into toe stand. I didn't even bother attempting it, thinking that it would take me years to get to that point. Today, I held the full expression with only a few wobbles, and stood right out of it without a hitch. \n\nI'm so excited to continue surprising myself. :)"
  },
  {
    "selftext": "With an intention to be so simple in my question that I hope the nuance will come through in your answers, I want to know what you think."
  },
  {
    "selftext": "Obviously this is not a seriously pressing issue here, but there are two classes back to back at my studio tonight.\n\n1.5 hour class followed by a community hour lead by teachers in training. 15 minutes in between.\n\nAny reason its a bad idea to do both? I've been craving more after my classes, but also think that taking taking the 15 minutes for shavasana would be wonderful. \n\nOr should I not do shavasana and take something else?"
  },
  {
    "selftext": "Jai Guru Dev from India my dear friend.. ��"
  },
  {
    "selftext": "It’s dark. My eyes are covered. Instrumental music plays softly to my right. It’s hot. I feel the drops of sweat as they roll across my skin. I lay still. I breathe in. I can feel the floor beneath me, supporting me. I can feel my body pulsating to the rhythm of my heart beat. I exhale. A bead of sweat rolls between my parted lips and finds its home on my tongue. It tastes good. I wipe the sweat from around my mouth and return my arm to the floor beside me. My mind is clear but for the sounds and sensations in this place, in this moment. I feel each baby hair on my upper lip and chin release itself from my skin to stand at attention once more. The door of this room opens. I can hear the soft padding of bare feet. The door closes. I wiggle my toes to prove they’re still there. I press my shoulders into the floor. A breath of cool air tickles my toes. It moves ever so slowly up my leg, as if it knows it’s not supposed to be here. Not in this room. And then it is gone. Was it ever there? A figment of my imagination? I inhale. I thank my body for the work it has done. I exhale.\n\nShavasana"
  },
  {
    "selftext": "I've been doing yoga consistently for about 3 years now and still struggle with maintaining focus and concentration throughout my practice. \n\nRecently, I've begun to experiment with supplements like L-Theanine and CBD, and have found them to be extremely effective. My balance is better, more consistent Ujjayi breath, and I usually leave with a deeper sense of gratitude.\n\nConsidering how prevalent supplementation is in other forms of exercise (everyone I know who lifts weights takes pre-workout, creatine, etc.) it seems like there should be something for yogis. \n\nDoes anyone know of anything like this or has anyone used supplements to elevate their practice? Does anyone else feel similarly? \n\n\\~Namaste\\~   :)"
  },
  {
    "selftext": "Hi all,\n\n  \n\n\nI'm looking for suggestions of routines that are suitable for children 10-11 years old. Hopefully about 45 minutes long, and suitable for a variety of abilities.\n\n  \n\n\nYouTube?\n\n  \n\n\nThank you!"
  },
  {
    "selftext": "samana: over the samana vital air; jayat: by mastery; jvalanam: effulgence\n\n*By mastery over the samana vital air, radiance is attained. \\[Bryant Translation\\]*\n\nFirst of all, please accept my humble apologies for the length between this sutra and the last. This will not usually be the case. I had some personal issues arise, and I was taken out of town for a bit, as well. \n\nI’m going to include a bit of the commentary Bryant provides here: “By stimulating the fire in the body, one becomes radiant and effulgent (jvalana), say the commentators. Hariharananda notes that the samana-prana is responsible for nourishing all parts of the body,  and so, by mastering this prana, the yogi gets an aura around the body … explainable in Yogic vocabulary by the prominence of the radiant and effulgent characteristics of sattva pervading the yogi’s chitta, and emanating out due to transcending the limitations of the klesas.”\n\nI am going to do what I did last time with the discussion questions, and bring them back down to a plane that is more easily relatable. As will always be the case, you are most welcome to discuss this sutra in its more literal sense, as well. I just prefer to have more relatable discussion questions included, so that all types of yogis and readers of the sutras have something to discuss, depending on their inclinations. \n\nThis sutra focuses on the samana-prana, which nourishes the body as a whole and is related to the stimulation of fire, or agni, within the body. It is located in the navel, is associated with the manipura chakra, and governs digestion, processing and assimilation. I have a several different questions for you this week. **How do you feel your yoga practice nourishes you? What do you think are the benefits of balanced and active digestion aside from the processing of the food we eat? What other kinds of digestion are there? Why does this matter?**"
  },
  {
    "selftext": "I'm looking for a fairly specific video to meet my needs, so hopefully one of you fantastic people has stumbled across it in your travels!\n\nI am a busy guy. I work 12 hour shifts, lift weights 4-6 days a week, train BJJ 3-4 days a week and I take long dog walks as often as possible.  I don't have time for a whole yoga class. I've been using [www.yogaforbjj.com](https://www.yogaforbjj.com) for a few weeks now and it was exactly what I needed... until it wasn't. I already lift and train hard, I don't have it in me to be doing the more aggressive calisthenic type stuff that the instructor was getting in to. I try and get the flow in after lifting, so lots of core and push-up type work is too much, my arms/legs/core are already exhausted.\n\nI'm hoping to find a 10-15 minute flow to work on my mobility, ideally something with some thoracic spine work (updogs, etc) and some hip openers (like pigeon). Something that I can do (almost) every day to help improve my movement, posture, etc. I have no urge to become a yoga practitioner, I just find the Vinyasa style stuff does wonders for movement and range of motion.\n\nSo, have you stumbled across anything like this? I don't mind paying for it if it is what I'm looking for."
  },
  {
    "selftext": "I'm looking for something with an elastic waist that is stretchy and cut loosely. The prana pants have a nice material but the butt is cut wayyyyy too small, and gives me a wedgie.\n\n&amp;#x200B;\n\nAnyone know of such a pant? The lululemon men's stuff doesn't work because the waistbands aren't elastic and they fit like skinny jeans anyway  \n\n\nSomething like the Moon Samurai pant, but available in the US"
  },
  {
    "selftext": "I'm new to yoga, and I want to improve upin my flexability as I'm mostly not very flexable. But I don't really know any exercises or where to gst started so I am coming here for advice on what exercises to do, how long to do it, etc. Any advice will be appreciated."
  },
  {
    "selftext": "I'm an 18 year old male and I have tried yoga , and I have tried meditation. I've read that you yoga and meditation is really helpful. I've tried doing yoga but to me it's just SOOOO boring. I've tried meditating too, I've tried to clear my mind, think of nothing, but when I do, I just start thinking random thoughts and I start remembering things and I just can't focus, I also get bored too. I want to learn and I've tried but I just can't seem to pick it up."
  },
  {
    "selftext": "I’m struggling with this. When I attempt to “pull up my kneecap” it just feels like I’m tightening my thigh muscles. Any pointers?"
  },
  {
    "selftext": "I'm wanting yoga basically to help keep me from being a potato, work on my balance/core strength, and help deal with stress. \n\nI have some experience going to classes in the past for a few months, but it has been awhile.\n\nCould anyone give me pointers on what type of yoga or where to start looking online for yoga routines I could do at home here and there throughout my work day? \n\nI cant really go to a studio at this point and I figured some expert trait advice before just searching through the internet would be a good ide.\n\nI searched the FAQ and reddit search and found a lot just wasnt sure if it would be best for my situation.\n\nTha k you for any help."
  },
  {
    "selftext": "I'll be moving there, and I'm hoping to move close to a good studio (I aim for 2 studio classes a day, and my current studio is 20 minutes away without traffic, which sucks). I also teach as my only form of \"work\", so finding a studio is my top priority. I know that I'll have to check it out in person, but I'm just hoping some of you lovely people have some insight so I can start planning my yoga sightseeing trip. \n\nI like hot, sweaty, fast, power, vinyasa, Ashtanga, Baptiste, etc.\n\nWorkshops aren't as important to me as regular class offerings.\n\n A studio culture of community (i.e. talking to your fellow yogis before/after class) would be nice.\n\nI do enjoy/respect the spiritual aspects of yoga as well as the Indian origins, so use of Sanskrit, talk of chakras, sutras, etc. is welcome. \n\nI appreciate any insight."
  },
  {
    "selftext": "I'm a new yoga teacher who just started teaching 3 morning classes/week at a gym. So far I love it...there is a large group of dedicated students that make it to every single class of mine, and so far it's gone really well. I learn something new every single class and look forward to gaining more experience as time goes on.\n\nHowever, there's this one student in particular who seems to find issue with almost everything--I was actually given a heads up about this student before I ever met them, as they are \"known\" at the gym for their constant complaints. I was advised by my boss to not take any of it personally or too seriously, because that's just how this person is.\n\nWell, right away I knew who this student was because sure enough, I had a flood of commentary from them at the end of the class--however, this student has now told me on multiple occasions that they really enjoy my class, so that made me feel amazing! If the notorious complainer likes my classes, that's an accomplishment, right?\n\nAnyway, after class the other day, this student approached me to complain about how obnoxious they find the other students...most of the class has attended yoga together for over a decade, so the minutes before class are often spent chatting. According to this student, it comes across as \"bar room banter,\" obnoxious, and far too loud for yoga. While I personally don't find the other students too loud, and know that this particular student is very opinionated, I also want EVERYONE to feel welcome in my class. So this morning, I made an attempt to quiet things down before class started by suggesting that everyone get into a comfortable position on their backs in preparation for centering. This helped a little, but not everyone quit chatting and the student who complained to me spent several minutes literally shushing everyone in the room. So I wasn't surprised when, after the class, they complained again about other students talking before class. The student said they love my class, the pacing and flow, etc...they actually said it's PERFECT for them, but that the other students \"totally ruin it.\" They did mention that they noticed how I got the class into a supine posture before class started, but basically implied that wasn't enough. They then went on to kinda sorta lecture me about how control of the class is part of teaching, that they're a teacher too (a school teacher, not a yoga teacher..prob important to make that distinction!), and that what I should specifically do is tell them to \"pipe down\" (exact phrasing here) and/or make them do a breathing exercise before class starts, specifically one \"where their tongue is on the roof of their mouth so they are physically unable to speak.\"\n\nMy friends, I was kind of flabbergasted at this point. So here is my thing. I realize that this student is a bit...special. It doesn't help that I personally don't find the noise levels to be unreasonable before class, especially since this is absolutely never a problem once the class itself begins...everyone gets into \"yoga mode\" right away and we're in that mode all the way through. However, like I said earlier in this post, it's really important to me to make sure that EVERY student is comfortable in my class. Short of rolling into the studio on Monday and telling everyone to \"pipe down,\" I guess I'm looking for a happy medium, if that makes sense??? I'd love for this student to NOT feel like class is being ruined for them, but I also am not really willing to stoop to the level of a third-grade teacher lecturing an unruly class that honestly isn't even unruly.\n\nI actually am not against a breathing exercise before the start of class, as this student mentioned..I guess the issue with that is, the yoga class is scheduled at a set time. Who am I to determine what the students do before that set time? It's a small gym, too, so having students congregate outside the studio room beforehand to do their chatting doesn't make sense nor do I think that type of congregation is even encouraged for safety reasons. Is it out of my bounds to ask students to do a breathing exercise before the class even begins?\n\nObviously, this is a thing I will be bringing up with my boss the next time I'm there, but since I have the weekend off to ponder this, I figured I'd see what my Reddit yogis think :) Any suggestions???\n\n&amp;#x200B;\n\nUPDATE: Just want to thank everyone so much for responding!!! Basically everyone here is on the same track I was already on, so I feel better knowing my gut was going in a reasonable direction haha. Thanks again!"
  },
  {
    "selftext": "I have not the best posture and I have been really struggling with this pose. Does anyone have any tips for a proper half-way lift, especially when you are repeating the pose? Ty in advance"
  },
  {
    "selftext": "Any advice on teaching poses for students with back disc pain/herniation? I know they should avoid forward fold but what do I add into a vinyasa class? Thanks in advance!"
  },
  {
    "selftext": "I do hot yoga and find that traditional workout clothes dont work too well. Any brands to recommend?"
  },
  {
    "selftext": "Could someone explain, please?"
  },
  {
    "selftext": "I do not have access to a yoga class where I live and have started doing yoga at home using the Down Dog app. I think it is great and as I get into some poses more and more, I get more comfortable and realise what I should be doing to execute them correctly (sort of self-adjustments). What can I do to make sure I am doing poses the correct way? I usually do 20-40 minute flows, so I never really practise just one position for the sake of it. Should I be doing this? Additionally, should be too worried about breathing or does it automatically come with time and practise? Sometimes I manage to breathe along with the instructions, but sometimes I need more breaths as I transition, or mix up inhales and exhales. Thanks in advance.\n\nTo put the position issue into context: my possibly worst and most difficult pose is seated forward bend/fold. I find it impossible to keep my back straight as I reach forward, even though I lengthen at every inhale."
  },
  {
    "selftext": "Apologies if this is irrelavant but I recently started working out and I'm looking to do deadlifts. However, I can't seem to hip hinge correctly and just keep arching my back. \n\nDoes anyone have any advice or techniques to use? \n\nThanks in advance!✌"
  },
  {
    "selftext": "Im over weight, but i love yoga. It's hard to find time/effort all of the time, but when I do, it's always a good experience. I'm out of practice, and stiff as hell.   Id love to hear peoples experiences of overcoming excess flesh for certain poses."
  },
  {
    "selftext": "Hello everyone, I received some messages asking about [myyogalist.com](https://myyogalist.com) and just wanted to tell everyone that it's back up!! Honestly it was down for a while because we had decided to stop paying for the service and leave it running so it can continue to be free but then we ran out of free hours. \n\nMy husband and main inspiration to build this webpage (as well as the programmer behind it) is the main user and he missed it so much that he decided to start paying again. \n\nFor those who don't know the page,  I created it as a way to share with friends and family the yoga videos and online youtube teachers that helped me in my own yoga home practice and then realized it could be useful for more people.  It is divided into levels so you should be able to find something right for you and also has a Yin Yoga section. \n\nI hope you give it a try and enjoy your practice."
  },
  {
    "selftext": "As the title says, I had a shoulder injury which has led to symptoms of thoracic outlet syndrome. I've been doing lots of physical therapy, posture and back exercises, pec stretching and rotator cuff work. So any poses that include that stuff is great. Prior to this injury I was doing yoga regularly, and I really want to get back into a practice but have trouble accepting this new \"normal\"....but hopefully not normal forever. I lose the arterial bloodflow when I raise my left arm above my head. My right arm is fine and my strength on both sides is pretty good. Does anyone have any resources or modified pose ideas they can share? For instance, I can do warrior one, but I keep my left hand on my hip and extend my right arm up. Thanks guys! I think the biggest thing is just not getting discouraged with this and lots of trial and error."
  },
  {
    "selftext": "Has any of you gained height by doing yoga?\nBy how much have you increased your height?\nAnd for how long have you been performing yoga?\nPS . i know the gain would be from postural changes"
  },
  {
    "selftext": "TLDR - Can anyone recommend a long term (1-6 months), affordable yoga retreat (anywhere in the world), for an intermediate yogi?\n\nHello. I’m looking for a place to relax, learn, work hard, detox, and develop a deeper understanding and more consistent practice. I plan on changing careers soon and this is something I want to do with my time in between. I don’t care how ‘nice’ the sleeping arrangements are. I don’t care where in the world it’s located (although I hear India is nice ;). Healthy food is important. Good teachers are important. \n\nI’ve been practicing yoga (mostly asanas, some meditation, some lifestyle) on and off for about a decade, from casual classes to weeklong retreats and private lessons. However I never make it past about 6 months of regular practice. For one reason or another, I’ll stop for a time, then pick it back up again. \n\nCan anyone recommend a long term (1-6 months), affordable yoga retreat? Maybe a work-study? Or something modestly priced, I do have some savings. Thank you in advance for any offerings, general or specific."
  },
  {
    "selftext": "Hello everyone,\n\nOkay so I’ve heard alot of things about yoga .\nNow if i’m wrong and I should just leave here I understand.\nI’ve seen people and read about people that do Yoga. How it changed their lives , better their relationship , how they think , etc...\nMy wife and I recently  been going through a rough patch in our marriage . Not to get into details but it involves cheating , lying , anger issues , and no self- control . These are the key things. \nSome could say we’re toxic for each other yes.\nWe have been looking at counseling and I know for some of you reading this I know thats probably what you would recommend .\nLike I said though and this is just to see how many different answers I can get. I know none of this is guarantee this will work for us , but hey i’ve never heard anyone bash on how effective Yoga can be unless they haven’t tried it before."
  },
  {
    "selftext": "I have super long, super thick hair and thick bangs that I can’t handle being in my face in hot yoga. I got some cheapo headbands that were highly reviewed on Amazon but they are slipping out of position during my practice. Any recommendations for headbands that will stay in place?"
  },
  {
    "selftext": "I don’t know if this subject belongs in this subreddit but here we go. (I do realize this subreddit is a health and fitness category, but I’m hoping this spirituality topic is accepted, if that’s what it’s even considered maybe I’m wrong, let me know what subreddit I should discuss this in if it’s not an accepted topic here)\n\nAnyways...\n\nPronia basically means that the universe is conspiring to help you. (It’s a new word derived from Yogācāra community, I think, or maybe it’s just a translated term from Buddhist or Hindu teachings)\n\nHere’s my pronia story (or lucky coincidence) you be the judge.\n\nLast night I posted a subject in the r/Krishnamurti subreddit asking if “holding onto something contradicts our being” is the basis of Jiddu Krishnamurti’s teachings. The second I hit the post button, I look up at the TV at work which is preprogrammed daily to show image based news and quotes. The quote read “When you hold on to your history you do it at the expense of your destiny.” by T.D. Jakes (he’s a pastor)\n\nHere’s where it starts to get weird—\n\n1. I sat down to eat lunch at work (I never sit down to eat lunch at work, I ALWAYS wait till I go home, been working there 8 months now)\n\n2. I’ve never really paid attention to the TV at work\n\n3. I waited 30 minutes to see if that quote would pop up again with no luck.\n\nMy question is, what does this all mean?\n\nIs it a lucky coincidence? The odds of this happening are extremely rare probably more rare than words you are saying in real life and someone on TV says it right after you because it was literally the same “sentence” (not just one word) I had as my title in the r/Krishnamurti subreddit.\n\nShould I go buy a lottery ticket lol?\n\nUpdate: I went to go buy lottery tickets right after work from the gas station nearest to my work, I asked the clerk for 1 of each lottery ticket, random numbers...she goes to the machine and stares at it with confusion, after a couple minutes of her in a confused state she looks at me an apologizes. She said for some reason it’s asking her for a password, which it never does and she doesn’t know the password. I’ve never bought a lottery ticket in my life so I don’t know the process but seriously...\n\nLOL wtf is going on and what does it all mean..."
  },
  {
    "selftext": "anyone love their bolster for yoga or meditation? if so please share the brand, xo"
  },
  {
    "selftext": "Hello, I would like to get back into yoga. When I tried a few years back I used the Down Dog App, so I downloaded it again but it turns out that after three trials sessions you can’t use it anymore unless you pay for it.  \nIs there another free app similar to it in terms of simplicity and unclutteriness?  \nThanks."
  },
  {
    "selftext": "I am in the process of opening my first studio and looking for any advice from studio owners!\n\nWhat do you wish you had known before opening a studio? Where have you sourced trained yoga teachers from? How many monthly memberships do you have and how long did it take you to reach that number? etc. Any advice or tips are greatly appreciated!\n\n\n\nEdit for further context:\nI have a degree in Biology and a degree in Psychology. I've worked in the medical field and pharmaceutical industry for several years and - simply put - was very disappointed with the recommended treatments, lack of forethought for long term care and hated that an expensive pill was prescribed for every minor ache, pain or symptom when the answer was clearly the need for a lifestyle change. Once disillusioned with the medical field, I dipped back into the therapy field but also felt that it did not take a well-rounded approach to wellness.\n\nI have a strong background in the fitness industry (trainer, collaborating at a start-up gym to get it off the ground, strong knowledge of anatomy/physiology etc.) I have been casually practicing yoga for about 5 years and have taken it more seriously the last year. Looking for a change in career, I finally feel that yoga is the combination I am looking for.\n\nI have 2 wonderful partners/advisors (who will not be taking paychecks). One works in accounting/high finance and the other is a successful entrepreneur, both with the extensive business experience and marketing/tech background that I lack.\n\nCurrently doing a lot of market research and visiting all the studios in my city! I have a marketing firm that I will be utilizing for the majority of my marketing/advertising and website design in the beginning.\n\nI mentioned teaching the beginner classes myself because my anatomy/physiology background has really made me focus on proper positioning and alignment of limbs, joints, etc. I feel that I can help beginners to really get the basics down and build a strong foundation, but am not sure that I have all the flexibly and techniques of an experienced teacher down yet to feel competent enough to teach more advanced classes."
  },
  {
    "selftext": "Hello all,\n\n\nI have just started yoga as a way to get in touch with my body after a few surgical procedures. I am not in good shape I’m 5’11 249. I have been trying to rediscover my self. I am on day 3 of Adrian’s 30 day yoga challenge. I find myself struggling severely when it comes to doing downward dog and plank. I can only hold both for about 20-30 seconds before my hands hurt and I am shaking. There aren’t really any modifications to these that I have found. I am trying to power through it to better myself later on. Another thing I have noticed is that I am sweating and panting near the end of the video. Is this bad? Am I disrespecting the yoga culture by not being able to breathe correctly at the end?"
  },
  {
    "selftext": "What can I do to improve my three legged downward dog? My leg can’t get high up at all and even at the low height my hips aren’t square and my leg isn’t straight. Is there anything I can do to change this?"
  },
  {
    "selftext": "I want to start to take my practice outside to the park but am a little embarrassed...... I think I will feel self conscious because people will  look at me. I dont feel that way in the studio at all. I guess because we are all doing it. But doing it by myself just seems like it will be challenging.....How do you overcome feeling self conscious when practicing in public?"
  },
  {
    "selftext": "Has anyone had any experience with this, or have ideas? I’m going into the White mountains, so deep forest, and I’m also going ultra-light packing and definitely can’t bring a mat or any other “traditional” props (or the weight of a normal towel as a multi-tasker)"
  },
  {
    "selftext": "Looking for a new yoga bag! Does anyone have one they love and would recommend?\n\nI practice about 3x a week. I want something that will carry my mat and has room for a yoga towel, water bottle, a set of clothes for work, toiletries, and spare work out clothes (I clean my studio after class).\n\nI’ve had [this Gaiam bag](https://www.gaiam.com/products/95-1516) for 3 years and it has served me well, but it’s now literally falling apart. \n\nI wouldn’t want anything smaller than this.\n\nThanks!"
  },
  {
    "selftext": "I’m worried I may have pissed off my yoga teacher by doing so... �� She pulled me aside after class and told me I’m no longer welcome to attend classes with her. I can’t think of anything else I could’ve done to ellicit this kind of a reaction.\n\nFor context it was just a regular yin class, focusing on hip movements in particular."
  },
  {
    "selftext": "Hi everyone! These have been on my mind for a while so I thought I may as well ask.\n\n1) What’s the general feeling on opting out of the chants? If I know what words mean I kinda try to channel that internally (if that makes sense) but otherwise I just don’t feel comfortable repeating phrases when I don’t know what they mean. I’m not deep into the spiritual side of yoga, although I do love the focus on non judgment, honesty, acceptance, etc because I am a very anxious person. I’m very subtle about it and I do always bow my head and thank the teacher after class.\n\n2) Ladies wearing only sports bras on top. I don’t do heated classes but I sweat a ton. Normally I wouldn’t think twice but my studio clientele leans more toward middle aged women and nobody even shows midriff usually. Is it weird??"
  },
  {
    "selftext": "Hi all!\n\nI have a 2 year old and am currently pregnant with my second. I’ve never really done any yoga except one class for fun when I was 15. But I would really like to get in to it. There are no classes in the small town I live in and being in Australia I’m 12 hours from the nearest class. Can anyone recommend a site or YouTube channel or something that may be able to offer good classes/instructional videos for pregnancy or including a toddler!\n\nThank you all!"
  },
  {
    "selftext": "Haven't been all summer and I just haven't been wanting to go since I've been so busy and I also prefer to be active outdoors in the summer months.\n\nI've been telling myself I would go back when the time felt right.\n\nYesterday I had no plans and the timing felt right so I went back and had a great class.\n\nA lot of people noticed I had been gone for awhile and hugged me and asked about my summer (THIS is one of the pros of having a home studio community---I know this topic comes up often).\n\nI have taken a couple of other style classes this summer so got into a discussion about that too with peers, one who is actually trialing all kinds of yoga as she contemplates teacher training.\n\nAnyways, it was so nice to be back and I look forward to cultivating a regular practice again as the summer winds down."
  },
  {
    "selftext": "Reason im asking:\n\nhttps://www.normalbreathing.com/how-to-sleep-less.php\n\n&gt;Ancient hatha yoga manuscripts claim that yoga masters (with over 3 min for the body-oxygen test and about 6-9 minutes for maximum breath holding time) sleep naturally for 2 hours only. These are ideal results. My students who got up to about 60 s for the morning CP test, commonly slept for about 4-5 hours only. With around 30-40 seconds for the morning body O2 test, sleeping about 6 hours is very common. Now we can suggest a scientific explanation to this effect since hatha yoga training is based on slowing down or calming the breath (see Yoga pages).\n\nCurrently just started exploring a Russian form of pranayama r/buteyko , many of the more experienced practitioners claim that it greatly reduces their need for sleep. \n\nhttps://www.reddit.com/r/buteyko/comments/c7uxxf/since_practicing_the_buteyko_metbod_how_many/\n\n&gt;One of the main reasons I've began practicing Buteyko among other health improvement habits is to be able to sleep less. I've started with around 10-15 CP and at my peak I passed 90+CP. I used to sleep 8.5 hours but during my peak I slept 5.5 hours every day. So basically I cut 3 hours of sleep naturally."
  },
  {
    "selftext": "Hello, I am a newbie to yoga and have a question (I tried looking in the FAQs first but couldn't find anything and I don't have anyone to ask). My problem is with downward facing dog. I don't think I have any problems with getting my butt in the air or keeping my back straight, but whenever I do it, my shoulders and arms start to go numb and I can never hold it for as long as the instructor on the videos does. Am I just weak in a certain area or am I doing something wrong?"
  },
  {
    "selftext": "I have pretty mild low blood pressure - usually if I stand up too fast, I get really dizzy and my vision blacks out for a few seconds before it gets back to normal. I don’t normally get symptoms that bad during yoga, but I do sometimes get a little dizzy when transitioning eg from downward facing dog to warrior I. Sometimes I get headaches after yoga class too, kind of like the blood vessels in my temples are throbbing too hard. Is this a bad sign? Is there anything I can do to avoid this / poses I should avoid? Thanks!!"
  },
  {
    "selftext": "Hey guys, wondering if you’ve ever tried the GRP mat and how that compares to the lulu one?"
  },
  {
    "selftext": "I broke my wrist in late July. Got the cast off 3 days ago. I want to be active but the only workout I really enjoy is yoga, I would go at least 5 times a week. Now, I have a membership at Planet Fitness but I kinda hate it. I don't like running and all the TVs and what not. I usually go, run a mile, do a core workout and go home. It's not helping me mentally and spiritually like yoga does but the physical aspect of yoga seems so tied in to the mentally restorative aspect of it. Should I start to meditate, should I go to the class and make up mods? I don't know, I just really miss the feeling and the community of it. Any suggestions would be helpful."
  },
  {
    "selftext": "Hello! Amateur male yogi here, mostly practicing hot yoga. I’m posting because I’m super curious about sites or shops here that other men have used to find their yoga clothes. \n\nIn hot yoga, at least for me, the less material the better, but I’ve had a hard time finding men’s yoga shorts that are short and tight to the body for less than $50ish dollars. \n\nHas anyone else had luck? \n\nThanks!"
  },
  {
    "selftext": "I'm on week 5-6 on the Light On Yoga Course.  \n\n\nAnd I see we start learning Sitting pose much later in the course (16th and 17th week)  \n\n\nI sometime try Siddhasana cause It seem's like the easiest sitting pose in the book but It just hurt my knee :s"
  },
  {
    "selftext": "Can one do alternate nostril breathing pranayama before sleeping?"
  },
  {
    "selftext": "I've tried for about 5 years now to embrace the vinyasa flow yoga that is the only option at the various studios in my town, but it really is not for me. There isn't anyone local teaching kripalu (my real preference) or even iyengar. So I'm wondering if anyone can recommend high quality yoga classes on line that are NOT flow/sun salutation based? I'd love something that progresses from class to class, but really I'd take anything. I've found a handful of kripalu classes, but not enough to use long term. And it seems that often classes that are not flow based are gentle, and that's not what I want either. I just want time to dwell in poses, try micro-movements, and listen to my body as I work hard and challenge myself. Anyone have any tips on where/if this exists? I've explored the wiki and FAQ and didn't find anything that looked quite right. Thank you so much for any thoughts!"
  },
  {
    "selftext": "So I've been doing yoga off and on for a long tine, but the past couple of months I've really been enjoying the practices and getting the foundations of forms down. And I feel amazing. However, the only real problem I have is synching my breath in my practice. I have that problem in every day life and it's caused some dysphonia since I don't have proper breath support. Any tips to help build that up again and to help me with my practices?"
  },
  {
    "selftext": "Some background,  I'm a 24 year old male and after changing jobs this year I don't have the back strength or flexibility i once did. After having to take a 2 week break from golf because of a bad back I'm looking to get back into it but with better flexibility. I'm currently 2 days into a 30 day challenge by yoga with Adrienne but would like to get some in class training too. A studio close to my house offers a beginners drop in on sundays, some fundamental classes, and a all levels class every day (fits my schedule best). Will I feel out of place or be left in the dust during the All Levels? Is the 30 day challenge enough? Am I over thinking all of this? Any of your thoughts would be appreciated."
  },
  {
    "selftext": "i'm a noob here so please don't bash me or anything XD\n\nheight 175cm (still growing hopefully :D) weight 162lbs gender male\n\nlike the title, i'm 16 and i think i'm pretty not flexible. I want to improve my flexibility for injury prevention and martial arts. So just wondering is it still possible for a 16 year old to start stretching and become flexible or age has nothing to do with it?\n\nanyways i'd like to improve leg flexibility specifically, wanna be able to do the splits and kick high. I stretch on average about 45-60 minutes a day (just started yesterday) while holding each stretch for a minute. Will that be enough or will i need to stretch more?\n\nthe thing is i already go to a gym regularly and has gained pretty decent strength and some muscle mass at least for a 16 yr old. I'm wondering is gaining flexibility harder than gaining strength or is it about the same difficulty? Cuz I'm thinking to myself if i can get decent strength then i should be able to become flexible lol\n\nanyways yea, just ANY advice is welcome, i've been avoiding this problem for a while now but now i really want to get flexible, thanks"
  },
  {
    "selftext": "I paid for the downdog app in hopes that it would be a good way for me to learn to have proper alignment. Even when I put it on slow and “full instruction” mode, I’m not getting the subtle level of instruction I was hoping for. I feel like I need more help specifically with what direction my hips should be facing and what to do with my shoulders (since these areas of my body seem to just do what they want.) I love classes but I’m not getting that level of instruction there either. Signed up for some beginner Iyengar classes that I hope will be more helpful. In the meantime, any apps or YouTube channels you’d recommend to help with this?"
  },
  {
    "selftext": "I’ve had a tough week, especially with my PMDD wave peaking over the weekend. My first instinct was to make a post here because all of you have inspired me in the past weeks since I joined the group with pushing my boundaries and challenging my mind.\n\nNamaste!"
  },
  {
    "selftext": "Does anyone relate? Or have tips on this?\n\n&amp;#x200B;\n\nMy apartment is ittby bitty. Like 350 sq ft small. Good thing is it's temporary... in 6 months I'm only looking for places 500 sq ft and bigger.\n\n&amp;#x200B;\n\nWhen I do my home practice I can feel how much constrained I feel b/c of my limited space. For example, practicing inversions or other harder poses. I know it's mostly a mental block, but somewhat legit too as I can/will bump into things or the wall if I'm not super cognizant.\n\n&amp;#x200B;\n\nIt's bumming me out because I'm so much better focused in classes or workshops and see how much more I improve when really focusing on my body, aligning, where I am in space, etc. It feels really stifled when I practice at home. :("
  },
  {
    "selftext": "I’ve been doing yoga for 6+ years (i’ve gone through dry spells) and still can’t get deeply into standing forward fold. what are your favourite poses that assist in getting more deeply into this pose ? :)"
  },
  {
    "selftext": "I used to do yoga classes regularly, but a couple months ago I stopped being able to control my bladder. This was because I was taking neuroleptics (anti-psychotics) and incontinence is one of the side-effects of taking them long-term. I can't stop taking them, but there might be other options in the future  \nSo I'm trying to exercise. I run, take a spin class, and I want to do yoga again, but is that even possible?  \nIs there a way to stop a diaper from showing when doing complex poses?  \nI was hoping someone here had some experience with this, like maybe incontinence after pregnancy?  \nWhen I went to yoga, I was one of the only guys, so being surrounded by women makes it a thousand times more embarrassing if someone notices a pull-up poking out of my shorts.  \nI'm really curious if you or someone you know dealt with something like this, because I don't want to be more limited by this problem than I have to be.  \nIf I have to, I'll stick with other exercises--elliptical, running, etc--but I do want to get back into yoga. When I stopped, I was finally starting to make progress with my core."
  },
  {
    "selftext": "Hey all,\nI have no issue deep breathing during yoga poses or throughout the day when I’m not speaking. However, whenever I talk, am I supposed to hold in the breath or actively breathe while speaking?"
  },
  {
    "selftext": "does anyone get teary-eyed and randomly sob after a yoga session? today was the third time this has happened to me and i thought i would ask about it."
  },
  {
    "selftext": "Hola.\n\nDoes anybody find these two poses incredibly challenging? I can do most of the easier arm balance poses eg. Crow, Side crow, Eight angle, Flying pigeon, Grasshopper Firefly... but these two just feel totally out of my league!\n\nIt is quite surprising to me because after firstly learning crow, I could usually get the \"hang\"/ \"feel\" of other arm balance poses and then practise it until I can hold it. But these two somehow feel like a total leap of skill. I'm crashing every day which is quite discouraging.\n\nFor those who have mastered the poses, how did you get there?  \nAre there some poses I should be learning in between? Or a particular muscle group I should be focusing on? \n\nThank You!"
  },
  {
    "selftext": "Let me share my experience of staying at Isha Yoga Center in Coimbatore for 2 weeks. My experience there was very weird and it is hard to explain what I feel here. \n\nI was a big fan of Sadhguru and watched a lot of his Videos and read his book. I also practiced his Aum Kara and Isha Kriya and really liked the effects I got from it...\n\nSo I had very big expectations when I came to Isha Center at Coimbatore for Guru purnima celebration...\n\nI have been staying at Isha for over 2 weeks now... during this time I saw Sadhguru live 2 times and I also attended his Inner Engineering Program. \n\nWhen I first arrived at the Center I could immediately feel a strong energy. Within minutes it is like all your stress and worries are taken away, you feel a certain peace...\nWhen I went to the Dyanalinga I could feel it vibrating in my chakras, especially the heart, throut and eyebrowcenter, also my head went automatically up to the tip of the lingam. It is like a magnetic pull... So I sat there very peaceful and very thoughtless for over an hour...\n\nThe first days here I was quite amazed by this strong energy and I thought I found the best place ever.\n\nBut the first weird thing that happend, was the connection with my girlfriend who was with me at the ashram. Somehow we couldn't communicate properly. It was like something was blocking our relationship. It is like sadhguru doesn't allow you to be here as a couple!!!\n\nWhen the IE Program started, I felt even weirder. The whole Program felt like a brainwash to me... \n\nAfter the program I volinteered here for a week. I saw under what terrible conditions the people live here. Some are sleeping on the floor, getting 2 meels per day working 8-9 hours a day, 7 days a week, without payment!!!\nAnd people here are not happy. They are not Joyful. It is not the way sadhguru describes it. People outside the ashram in the city look more joyful.\n\nNow after observing clearly I understand the energy here... It is not the pure divine energy it is supposed to be. It is highly programmed. It controlles the way you think and feel. It somehow enslaves you to behave and do what sadhguru wants you to do and think. For example you cannot think In sex here. It is not possible... But you also cannot judge properly. You are not questioning...\nEverybody here is blindly following sadhguru and repeating his words like robots... \n\nLet me tell you the weirdest thing... There was a day when Sadhguru got sick in Australia. He posted that on Instagram. And the next day everybody was little sick at the ashram!!! My girlfriend told me that during the day she heard that sound, this noise sadhguru makes when he iniciates all the time...\nWhat if sadhguru uses his people as a battery??\nLike a big energyfield out of his followers for his own purpose???\nThis is just a theory of course...\n\nBut fact is that the energy in this place controlls you in a strong way and nobody here seems to be aware of that... I don't see the people here free or joyfully. It lookes like an exchange. You get some kind of peace and this \"everything is ok\" kind of feeling, but you exchange it for your possibility to think and akt for yourself. I see some people here very, very deluted. Especially the people that are staying here long-term seem to be completely enslaved...\n\nSo I ask myself what is the purpose of all this??? What is sadhgurus real plan?? Wellbeing for humanity??\nDoesn't look like that to me\n\nThis is my experience with Isha...\nEverybody seems to be super happy with this place...\nAm I the only one who sees things like that???"
  },
  {
    "selftext": "Hi Yogis,\n\nI am a Toronto based yoga instructor.  I did not renew my Yoga Alliance membership this year, I've been teaching for 5 years and no one had ever asked me about it.  I potentially have an opportunity at a studio who wants to know if I have a membership with the CANADIAN Yoga Alliance.  I don't.  \n\n\nI would consider it I guess if it meant the difference between getting the job or not, but I feel like it's just more of the same bullshit?   Just wondering what you guys think about all this stuff.  Yoga is my side hustle but I want to be successful with it."
  },
  {
    "selftext": "I was wondering if yoga could be a good start towards working out. Ive been out of shape for years and full on workouts are currently really difficult. I currently get worn out. Very quicly and find my body feels \"tight\" like i cant move as freely as i would like to. Would yoga help prepare my body for workouts like aerobics? Im hoping it woth get my body in shape and improve my balance so i can move on to workouts that are currently hard to do soon."
  },
  {
    "selftext": "My usual strategy of activating my core doesn't eliminate all the strain on my lower back when transitioning. Currently I just drop to my knees first to be safe, but I would like to be able to keep up during an ashtanga class. I feel like maybe I need to round my back out first (like in cat pose), before transitioning. It's moving while it's scooped (like in cow pose) that seems to put strain on my back. But again, it's hard to do this in one breath and feels awkward."
  },
  {
    "selftext": "Hey! I’ve dabbled in yoga a big handful of times over the past 8 or so years but every time I’ve been discouraged by back pain. I have mild scoliosis which may or may not be affecting my practice. My question is whether or not the lower back pain I experience when trying to keep my spine straight in a seated position is a sign of muscle development, or my body fighting against a straight spine. \n\nThanks!"
  },
  {
    "selftext": "Hi Reddit, I am interesting in starting yoga and have a question that I can't seem to get a decent answer for elsewhere on the internet. I have been struggling with a wrist injury for about a decade now and have recently recovered-ish from an operation I had on it a while ago. I have seen people say that when you are starting out with yoga you have to be weary of your wrists so I am posing the question of, is starting yoga worth it for me given the wrist issues?\n\n&amp;#x200B;\n\nLook forward to hearing responses and thanks in advance!"
  },
  {
    "selftext": "Hi all,\n\nI received some great advice and videos here with an earlier post so I thought I'd come back for some more. First off I know that the recommended route is joining a class but it's not an option for me for personal reasons I'd rather not go into right now :)\n\nThat said, I'm looking to find some yoga sequences/styles that I can practice which carry the least inherent risk of injury to my back. I've read a couple of books by Dr Stuart McGill who is an expert on back injury and is of the opinion that back flexion/extension under load wears out your spin over time and makes you more at risk of back injuries, and in general everything he advocates involves keeping a neutral spine.\n\nI've started following this advice in my non-yoga exercise routine (mainly strength training). So when I watch myself in the mirror trying to do some common yoga poses like forward folds I wince a bit because I can see how my back rounds despite my best efforts. Another thing I wince at is the process of rising up from a downward dog in the Sun Salutation A (where you bring your feet forward and then stand up straight, my spine is never neutral here).\n\nMaybe it's because my hamstrings aren't flexible enough yet and I guess that will come with time and more practice. But until that point what kind of sequences/videos would you recommend that don't involve 'risky' poses like the forward fold where it's tougher to keep your spine neutral?"
  },
  {
    "selftext": "I recently got out of a wheelchair and am looking to do occassional private lessons at a hot yoga place to get a modified routine. I've done regular hot yoga classes before but it will be a while before I can handle a group class. \n\nI can't really afford to do a private lesson every time I want to do my routine, though, and I'm wondering if I could use the heated studio between classes to do my routine. Is this a thing at all? Do studios rent out their down time or would there be some kind of liability issue?\n\nWould I be better off just hiding in a corner during a class and doing my own private routine or would that be disruptive to the class? \n\n\nAlso, for those who give/take private lessons how frequently are these typically spaced apart?"
  },
  {
    "selftext": "I'm curious to hear what a private yoga session is like from people who have taken them. Is it basically like a class but with more feedback or is there more back and forth? Should I have a specific goal going in or will they evaluate and find where I need to focus on?"
  },
  {
    "selftext": "I kicked cancers ass after it touched my breast and now need to find some low impact exercises!  I am almost finished with my reconstruction and have been told I can do some light exercising and increase to more after my last surgery, am also about 6 weeks post chemo.  I have wanted to try yoga for a while now, but life keeps getting in the way.  Was hoping someone could direct me as to which classes to sign up for?  I am 39/f, rather flexible, ex gymnast- many moons ago, sorta limited movement with arms above my head- but hope that is alleviated with yoga, prefer a class setting vs doing it on my own till I get the hang of it."
  }
]